[[{"synopsis": "In the magical land of Equestria, a studious, asocial unicorn named Twilight Sparkle learns of a prophecy that states the evil Nightmare Moon will return during the upcoming Summer Sun Celebration after a thousand years imprisoned in the moon. She tries to warn her mentor Princess Celestia, the benevolent alicorn ruler of Equestria, of the impending danger, but she dismisses her warnings and sends her and her baby dragon assistant Spike to Ponyville to supervise the preparations for the celebration and make some friends. As a result, Twilight reluctantly meets five ponies in charge of the preparations: Applejack, a country earth pony who works on her family's apple farm; Rainbow Dash, a tomboyish pegasus who helps control the weather; Rarity, a glamorous unicorn who designs fashion; Fluttershy, a shy pegasus who communicates with animals; and Pinkie Pie, a hyperactive earth pony who loves throwing parties. At the celebration, Nightmare Moon appears and decrees everlasting night.", "subseason_ep_number": "01", "absolute_ep_number": "01", "title": "Friendship is Magic, part 1", "writer": "Lauren Faust", "release_date": "2010-10-10"}, {"synopsis": "After Nightmare Moon decrees eternal night, Twilight and her new friends venture deep into the Everfree Forest to find the Elements of Harmony, a set of magical relics used to defeat Nightmare Moon in the past. Nightmare Moon creates obstacles to stop them, but each pony helps the group overcome them using her own strengths. Once they find the Elements, Nightmare Moon appears and shatters them. Twilight realizes that she and her new friends represent the six Elements: Honesty (Applejack), Kindness (Fluttershy), Laughter (Pinkie Pie), Generosity (Rarity), Loyalty (Rainbow Dash) and Magic (herself), and they wield them to defeat Nightmare Moon, returning her to her original form as Princess Celestia's younger sister, Princess Luna. Celestia returns, forgives Luna and allows Twilight to stay in Ponyville in order to continue studying the magic of friendship.", "subseason_ep_number": "02", "absolute_ep_number": "02", "title": "Friendship is Magic, part 2", "writer": "Lauren Faust", "release_date": "2010-10-22"}, {"synopsis": "Princess Celestia sends Twilight two tickets for the upcoming exclusive Grand Galloping Gala. Upon learning of the tickets, each of Twilight's friends insists she should be the one to go with her, and they start giving her special treatment to earn her favor. Twilight is unwilling to pick any one friend over another and she politely returns the tickets to Celestia despite her friends' apologies for their selfishness. To everypony's surprise, Celestia replies by sending back enough tickets for Twilight and all of her friends.", "subseason_ep_number": "03", "absolute_ep_number": "03", "title": "The Ticket Master", "writer": "Amy Keating Rogers & Lauren Faust", "release_date": "2010-10-29"}, {"synopsis": "Apple harvesting season is upon Sweet Apple Acres, but with her brother Big McIntosh injured, the task of bucking apples from their trees falls upon Applejack herself. Applejack insists she can do it herself, and stubbornly refuses to let her friends help. She quickly becomes weary from the work, but still upholds promises to help with other tasks around town. In her sleep-deprived daze, her assistance goes awry and wreaks havoc on Ponyville. Twilight intervenes, telling Applejack that her stubbornness has caused a myriad of problems and she needs help. When Applejack sees she only harvested half of the apples, she finally gives in and asks for her friends' help, which make the harvest more efficient.", "subseason_ep_number": "04", "absolute_ep_number": "04", "title": "Applebuck Season", "writer": "Amy Keating Rogers", "release_date": "2010-11-05"}, {"synopsis": "Pinkie Pie and Rainbow Dash discover they share a common interest in playing harmless pranks on other ponies. Later, Rainbow Dash's childhood friend Gilda, a griffin, arrives and Pinkie finds herself left out of Rainbow Dash and Gilda's activities. When Pinkie sees Gilda bullying other ponies around town, she becomes determined to cheer her up with a party. At the party, Gilda becomes the victim of several pranks, for which she blames Pinkie, but Rainbow Dash admits to setting up the pranks. Gilda becomes frustrated and flies off, leaving Rainbow Dash to reaffirm her friendship with Pinkie.", "subseason_ep_number": "05", "absolute_ep_number": "05", "title": "Griffon the Brush Off", "writer": "Cindy Morrow", "release_date": "2010-11-12"}, {"synopsis": "While Twilight practices her magic skills, a unicorn magician called \"The Great and Powerful\" Trixie arrives in Ponyville and boasts about being a powerful unicorn, outdoing stunts performed by Twilight's friends with her magic. Spike tries to get Twilight to stand up for her friends, but she refuses, believing the rest of town will hate her due to her own powerful magic. In an attempt to prove Trixie's power to Spike, the colts Snips and Snails lure a giant \"Ursa Minor\" bear into town for her to vanquish. Trixie tries to stop the bear, but her magic is too weak. Instead, Twilight is able to use her own magic to lull the bear to sleep and return it to its cave. As Trixie flees, the town thanks Twilight for her help, and she realizes they have already accepted her magical talent.", "subseason_ep_number": "06", "absolute_ep_number": "06", "title": "Boast Busters", "writer": "Chris Savino", "release_date": "2010-11-19"}, {"synopsis": "A dragon has taken shelter in a nearby cave, and his smoky breath threatens to cover Ponyville. Twilight and her friends are tasked with removing the dragon, specifically expecting that Fluttershy's affinity with animals will be useful. However, as they make the trek up the mountain, Fluttershy reveals her paralyzing fear of dragons, making the journey difficult for the others. At the cave, Fluttershy refuses to enter, and the others try their own means to evict the dragon, only to get knocked against a rock, hurting them in the process. Fluttershy becomes enraged and scolds the dragon for hurting her friends, causing the dragon to cower and cry in shame. Fluttershy asks the dragon to leave of his own accord, leaving Ponyville smoke-free.", "subseason_ep_number": "07", "absolute_ep_number": "07", "title": "Dragonshy", "writer": "Meghan McCarthy", "release_date": "2010-11-26"}, {"synopsis": "Applejack and Rarity have an argument over their respective approaches to work as they prepare for a thunderstorm. Their arguing causes them to be stuck outside when the storm hits, but Twilight invites them into the library to spend the night. Twilight decides to throw her first slumber party, much to Applejack and Rarity's regret. The hostility between them increases with each activity, with Twilight oblivious to the conflict. As they prepare to go to sleep, a lightning bolt threatens to send a tree branch into a nearby home. Applejack lassos it in time to stop it, accidentally dragging it into Twilight's bedroom in the process. Between the mess, Applejack and Rarity work together to get rid of the branch and clean up the mess, overcoming their differences. They later apologize to each other, and enjoy the rest of the slumber party with Twilight.", "subseason_ep_number": "08", "absolute_ep_number": "08", "title": "Look Before You Sleep", "writer": "Charlotte Fullerton", "release_date": "2010-12-03"}, {"synopsis": "Twilight finds out that the rest of Ponyville are frightened of the mysterious zebra Zecora who lives in the Everfree Forest, and insists their fears are unfounded. An encouraged Apple Bloom follows Zecora to her home, and the others quickly follow once they notice her missing. They recover Apple Bloom just as she enters a field of blue flowers, where Zecora warns them off. The next day, Twilight and her friends find themselves suffering from strange problems, leading the others to conclude that Zecora has cursed them. They find Apple Bloom missing again, and assume that Zecora took her. They race to Zecora's hut and confront her, only to find her and Apple Bloom making a potion to cure them of the afflictions, which were caused by the Poison Joke flowers they had stepped in the day before. Once cured, Twilight and her friends convince the townsfolk to be more trusting of Zecora.", "subseason_ep_number": "09", "absolute_ep_number": "09", "title": "Bridle Gossip", "writer": "Amy Keating Rogers", "release_date": "2010-12-10"}, {"synopsis": "While Twilight anxiously prepares Ponyville for a visit by Princess Celestia, Fluttershy finds a cute creature called a Parasprite and takes it back into town. The other ponies are enraptured by the creature despite its strange ability to reproduce quickly, and each adopt their own except for Pinkie Pie, who immediately starts to look for musical instruments. The next day, Ponyville is flooded with Parasprites that have begun eating everything in town. Twilight and the others try to get rid of them without success, and are frustrated by Pinkie's search for instruments. As the Parasprites start eating the town itself, Pinkie arrives as a one-pony band and leads the creatures out of town just as Celestia arrives. With the town emptied of Parasprites, Twilight and her friends apologize to Pinkie for doubting her behavior and promise to listen to her ideas and perspectives in the future.", "subseason_ep_number": "10", "absolute_ep_number": "10", "title": "Swarm of the Century", "writer": "M. A. Larson", "release_date": "2010-12-17"}, {"synopsis": "Twilight is eager to participate in Ponyville's \"Winter Wrap-Up,\" where the townsfolk help prepare the land for spring without using magic. Twilight tries to help out where she can, but finds herself struggling without her magic. As she frets about her inability to help, she overhears the team leaders arguing over the coordination of their activities and worrying that they will not complete the Wrap-Up in time. Twilight steps in, offering her skills in organization to get the Wrap-Up back on track. The Wrap-Up is successfully completed on time, and the town gives Twilight the job of official Wrap-Up coordinator.", "subseason_ep_number": "11", "absolute_ep_number": "11", "title": "Winter Wrap Up", "writer": "Cindy Morrow", "release_date": "2010-12-24"}, {"synopsis": "Apple Bloom becomes worried when two stuck-up classmates, Diamond Tiara and Silver Spoon, get their cutie marks and taunt Apple Bloom as a \"blank flank\" for lacking hers. Apple Bloom starts striving to find her own talent and get her own cutie mark, asking advice from her sister Applejack and her friends. Despite her efforts, she remains without her cutie mark. She finds herself caught within Diamond Tiara and Silver Spoon's Cute-ceañera celebration, and tries to leave before she is ridiculed. Just as she is discovered and teased by her classmates, two other fillies who lack cutie marks, Sweetie Belle and Scootaloo, stand up for Apple Bloom, assuring that she still has much potential in her life. The rest of the partygoers soon take more interest in Apple Bloom and her new friends than Diamond Tiara and Silver Spoon. After the party, Apple Bloom, Sweetie Belle, and Scootaloo form the \"Cutie Mark Crusaders\" to earn their cutie marks together.", "subseason_ep_number": "12", "absolute_ep_number": "12", "title": "Call of the Cutie", "writer": "Meghan McCarthy", "release_date": "2011-01-07"}, {"synopsis": "After a friendly game of horseshoes, Applejack and Rainbow Dash start boasting to each other about their athletic prowess. They begin an informal series of \"Iron Pony\" challenges to determine who is better, but Rainbow Dash, enabled by her wings, soon takes the edge. Applejack insists on one last event to decide the winner, the \"Running of the Leaves\" marathon, with the condition that Rainbow Dash keep her wings tied down. At the marathon, Twilight decides to participate despite her lack of athleticism. As the race starts, Applejack and Rainbow Dash take an early lead, and try to trick each other to keep their lead. As they near the end, they start to get more physical, and end up fighting across the finish line. To their surprise, they come in last while Twilight beats them in fifth place using her slow-and-steady pace. Applejack and Rainbow Dash realize their feuding is futile, so they accept their defeat and agree to keep to more friendly competitions.", "subseason_ep_number": "13", "absolute_ep_number": "13", "title": "Fall Weather Friends", "writer": "Amy Keating Rogers", "release_date": "2011-01-28"}, {"synopsis": "When Twilight brings an old dress to Rarity to repair for the upcoming Grand Galloping Gala, Rarity insists on making her and her friends new dresses. Rarity's designs for her dresses do not go well with her friends, so she agrees to remake the dresses with their input. She soon finds her friends' demands excessive and outlandish, but she does not question them. She is later shocked to learn Spike has arranged for the famous fashion designer Hoity Toity to come see the new dresses. As the show proceeds, Hoity Toity and the audience are disgusted by Rarity's over-the-top dresses, and Rarity believes her career is ruined. Feeling guilty, Rarity's friends complete her own Gala dress following her designs as an apology, and convince Hoity Toity to attend a second show using the original dresses, impressing him.", "subseason_ep_number": "14", "absolute_ep_number": "14", "title": "Suited For Success", "writer": "Charlotte Fullerton", "release_date": "2011-02-04"}, {"synopsis": "Twilight learns the rest of Ponyville believes that Pinkie Pie has a \"Pinkie Sense,\" in which her body reacts in different ways as warnings to certain events. Twilight insists this is impossible and attempts to understand how the Pinkie Sense works, though she ends up in a number of pratfalls from this. When Pinkie asserts that there is a \"doozy\" of an event in the nearby bog where Fluttershy is, she, Twilight, Spike, and Applejack take off to save her. They find Fluttershy safe, but are soon chased by a hydra. They all escape safely, but Pinkie asserts that her sense is still going off and the \"doozy\" has yet to happen. Exhausted, Twilight finally gives up trying to understand the Pinkie Sense. Pinkie's sense disappears, and she asserts that Twilight's revelation was the \"doozy.\" Twilight accepts that the Pinkie Sense is real, and that she should stop worrying about its origins.", "subseason_ep_number": "15", "absolute_ep_number": "15", "title": "Feeling Pinkie Keen", "writer": "Dave Polsky", "release_date": "2011-02-11"}, {"synopsis": "Rainbow Dash is set to perform in the Young Flyers Competition in Cloudsdale, planning to perform a \"Sonic Rainboom\" to win it. Fluttershy confides with her friends that Rainbow Dash has only been able to pull off the Sonic Rainboom once before, and that she is nervous about her performance. Determined to attend the competition and support Rainbow Dash, Rarity receives wings through a difficult spell courtesy of Twilight, while an easier spell allows the others to walk on clouds. In Cloudsdale, Rarity finds the pegasi enchanted by her wings and, spurred by a comment, enters the competition herself. At the competition, Rainbow Dash blunders the early stages before preparing for the Sonic Rainboom, while Rarity stuns the audience by flying high into the sky and showing off her wings. However, Rarity's wings disintegrate in the sunlight, causing her to plummet to the ground. The Wonderbolts in attendance try to save her, but she knocks them out with her floundering. Rainbow Dash sees Rarity in trouble and dives to the ground, pulling off the Sonic Rainboom and saving Rarity and the Wonderbolts in time. Rainbow Dash safely returns them all to Cloudsdale, where she is cheered on and named by Princess Celestia as the champion of the competition.", "subseason_ep_number": "16", "absolute_ep_number": "16", "title": "Sonic Rainboom", "writer": "M. A. Larson", "release_date": "2011-02-18"}, {"synopsis": "With Rarity engrossed in work, Fluttershy offers to watch over the Cutie Mark Crusaders for the night, however she finds them to be rambunctious and hard to control. At night, the Crusaders find that one of Fluttershy's chickens has escaped into the Everfree Forest, and they go out to retrieve it. Fluttershy soon discovers they are missing and follows their hoofprints. She eventually comes across Twilight and her chicken frozen into stone, and realizes a cockatrice is nearby. She finds the Crusaders and warns them of the danger, but they soon come face-to-face with the cockatrice. As the cockatrice starts to turn Fluttershy into stone, she gives it an intense stare and demands it reverse its spell. The cockatrice eventually relents, reversing its petrification of her, Twilight, and the chicken, and disappears. The Crusaders cheer for Fluttershy and call her the \"Stare Master.\" The next morning, Rarity comes to retrieve the Crusaders, and is surprised that they quickly fall in line with a simple request from Fluttershy.", "subseason_ep_number": "17", "absolute_ep_number": "17", "title": "Stare Master", "writer": "Chris Savino", "release_date": "2011-02-25"}, {"synopsis": "Applejack donates her old clubhouse to the Cutie Mark Crusaders. From there, the Crusaders try finding ways to get their cutie marks, but each time ends in comical failure. Twilight and Cheerilee suggest they enter the school's talent competition. The Crusaders agree to perform a musical number, but each of them want to do something in which they are unskilled: Apple Bloom wants to dance, Sweetie Belle wants to make the props and costumes, and Scootaloo wants to write and sing. At the show, they blunder disastrously through the song, confusing the crowd. To their surprise, they win the prize for best comedy act. Despite this, they still do not earn their cutie marks.", "subseason_ep_number": "18", "absolute_ep_number": "18", "title": "The Show Stoppers", "writer": "Cindy Morrow", "release_date": "2011-03-04"}, {"synopsis": "Rarity enlists Spike to help recover gems for a large order of dresses. As they work, Rarity is abducted by Diamond Dogs, who want her to dowse for gems in their caves. Spike races back to get the others to help rescue Rarity. Meanwhile, Rarity is able to use her wiles to trick the Dogs into treating her in a royal manner. By the time Spike and the others find Rarity, the Dogs are willing to let her leave with large quantities of gems, so they would not have to suffer under her anymore. The others help pull the gems back to Ponyville, while Rarity comments that one does not always need strength to win over one's enemies.", "subseason_ep_number": "19", "absolute_ep_number": "19", "title": "A Dog and Pony Show", "writer": "Amy Keating Rogers", "release_date": "2011-03-11"}, {"synopsis": "The famous fashion photographer Photo Finish comes to Ponyville to see Rarity's dresses she has made for the Gala. Rarity begs Fluttershy to help model the fashions. Despite her dislike of attention, Fluttershy agrees. Photo Finish is more taken by Fluttershy's shyness than Rarity's dresses, and declares Fluttershy to be an ideal model, leading her to stardom. Twilight becomes aware of Fluttershy's fear of disappointing Rarity and Rarity's jealousy of Fluttershy's success, but Pinkie warns her that telling these secrets to others can ruin her friendships, and Twilight frets over how to correct the situation. Eventually, Fluttershy and Rarity admit their secrets to each other, relieved that they agree, and Fluttershy gives up her modeling career.", "subseason_ep_number": "20", "absolute_ep_number": "20", "title": "Green Isn't Your Color", "writer": "Meghan McCarthy", "release_date": "2011-03-18"}, {"synopsis": "Applejack and her friends deliver an apple tree to the foundling frontier town of Appleloosa. They found out that the ponies of the town are in conflict with a nearby buffalo tribe, who have previously used the land as a running ground until the town planted an apple grove. Twilight and her friends work to establish peace between the two sides, but Pinkie Pie's song, performed at an inappropriate time, leads the two sides to declare war on each other. The buffalo charge at the town, who fire on the buffalo with apple pies. When the buffalo chieftain is hit with a pie, he discovers it is tasty and quickly puts an end to the battle. The two groups agree to a peaceful solution: the ponies leave a trail for the buffalo to run through the apple grove, while the buffalo get to enjoy apple pies made from the fruits.", "subseason_ep_number": "21", "absolute_ep_number": "21", "title": "Over a Barrel", "writer": "Dave Polsky", "release_date": "2011-03-25"}, {"synopsis": "Princess Celestia visits Ponyville along with her seemingly sick pet bird, Philomena. Fluttershy, worried about the bird's health, secretly takes Philomena to her cottage and tries to help her, but everything she does seems to worsen the bird's condition. When Twilight discovers this, she gets involved in helping cure Philomena, and learns that Celestia's guards are looking for it. Eventually Philomena escapes, leading Twilight and Fluttershy on a chase through town. The chase ends when Philomena falls from the top of a statue, bursting into flames and falling as a pile of ash into Fluttershy's hooves just as Celestia arrives. Fluttershy profusely apologizes, ready to take any punishment, before Celestia reveals that Philomena is a phoenix. Philomena rises from the ashes as a powerful bird, and at Celestia's insistence, apologizes to Fluttershy for messing with her.", "subseason_ep_number": "22", "absolute_ep_number": "22", "title": "A Bird in the Hoof", "writer": "Charlotte Fullerton", "release_date": "2011-04-08"}, {"synopsis": "The Cutie Mark Crusaders, believing they can determine how to get their cutie marks by learning how the older ponies in town got theirs, seek out and learn how Applejack, Fluttershy, Rarity, Twilight, Pinkie Pie, and Rainbow Dash earned their cutie marks. The six friends realize that Rainbow Dash's first Sonic Rainboom triggered the events by which each of them earned their cutie marks, and that they are closer than they originally thought.", "subseason_ep_number": "23", "absolute_ep_number": "23", "title": "The Cutie Mark Chronicles", "writer": "M. A. Larson", "release_date": "2011-04-15"}, {"synopsis": "Twilight realizes that Spike, being a baby dragon, is unable to stay awake to help her with her astronomy studies, but gets help with a new pet owl, Owlowiscious. Spike becomes jealous of Owlowiscious, thinking the owl wants to replace him as Twilight's assistant. Later, Twilight finds a book damaged by Spike's fire breath and scolds him for hiding it from her, and later still expresses disappointment when he tries to frame Owlowiscious for killing a toy mouse. Convinced that Twilight no longer wants him, Spike runs away from home into the Everfree Forest and finds a cave full of gems. He realizes that the cave belongs to an adult dragon, but Twilight and Owlowiscious soon arrive and save him. Twilight admits to Spike that she only needs Owlowiscious for additional help at night, and they reconcile while Spike makes friends with Owlowiscious.", "subseason_ep_number": "24", "absolute_ep_number": "24", "title": "Owl's Well That Ends Well", "writer": "Cindy Morrow", "release_date": "2011-04-22"}, {"synopsis": "After inviting her friends to and throwing a birthday party for her pet alligator Gummy, Pinkie Pie decides to throw a day-after party to continue the celebrations, but she finds that her friends all seem to be busy. Suspicious of their behavior, Pinkie follows her friends and discovers they are actively avoiding and hiding something from her in Applejack's barn. Pinkie becomes depressed, thinking they do not want to be her friends anymore. She throws her own party using inanimate objects when Rainbow Dash retrieves her and brings her to a party at the barn. Pinkie thinks her friends are throwing a party to get rid of her, only to realize it is actually her own birthday party, which she had forgotten. Pinkie quickly becomes happy and joins the celebration with her friends.", "subseason_ep_number": "25", "absolute_ep_number": "25", "title": "Party of One", "writer": "Meghan McCarthy", "release_date": "2011-04-29"}, {"synopsis": "The night of the Grand Galloping Gala in Canterlot has finally arrived. At the Gala, Twilight and her friends quickly separate to enjoy the Gala in their own ways, but each of them soon finds their experience falling well short of their expectations. As events mount, the friends' actions lead to a mass of chaos in the grand ballroom. They regroup later at a donut shop and express their disappointment with the night's events, but are soon joined by Princess Celestia, who explains that she had invited Twilight and her friends to liven up the normally boring Gala, and is happy with the results. Everyone agrees the night to be the \"best night ever.\"", "subseason_ep_number": "26", "absolute_ep_number": "26", "title": "The Best Night Ever", "writer": "Amy Keating Rogers", "release_date": "2011-05-06"}], [{"synopsis": "Following an argument between the Cutie Marks Crusaders, Discord, a draconequus known as the spirit of chaos and disharmony, escapes from his stone imprisonment. Princess Celestia summons Twilight and her friends to use the Elements of Harmony in order to recapture him. Unfortunately, they find the Elements missing and Discord teases them with a riddle. Believing the Elements are at the center of the Canterlot garden hedge maze, Twilight leads her friends there, but Discord manipulates them by separating them in the maze and brainwashing all but Twilight into polar opposites of their usual selves, with Rainbow Dash flying away in the belief that Cloudsdale is in trouble. Feeling triumphant, Discord thinks he has bested Twilight and continues to spread chaos all across Equestria.", "subseason_ep_number": "01", "absolute_ep_number": "27", "title": "The Return of Harmony Part 1", "writer": "M. A. Larson", "release_date": "2011-09-17"}, {"synopsis": "Twilight leads her friends to a chaos-affected Ponyville where she recognizes the true answer to Discord's riddle and finds the Elements in the library. However, without Rainbow Dash, they fail to work and Twilight is finally broken by Discord's spell. As she packs to leave Ponyville, Spike coughs up letters from Princess Celestia which are all of Twilight's old friendship reports. After reading them, Twilight's lifted spirits break Discord's spell on her and she uses it to return her friends to normal, including Rainbow Dash. They successfully turn Discord back into stone using the Elements and are welcomed by Celestia as heroes for defeating him.", "subseason_ep_number": "02", "absolute_ep_number": "28", "title": "The Return of Harmony Part 2", "writer": "M. A. Larson", "release_date": "2011-09-24"}, {"synopsis": "Twilight realizes she has until sunset to write her weekly friendship report to Princess Celestia and worries she will face terrible punishment if she is late. Spike and her friends dismiss her fears but she refuses to listen. After failing to find anypony in Ponyville with a friendship problem, she decides to cause one herself using an old doll infused with a spell to make the Cutie Mark Crusaders fight over it so that she can break up the fight. However, the fight gets out of control and the influence of the doll spreads across Ponyville. As the sun sets, Celestia arrives to reverse the spell. Fearing the worst, Twilight is relieved when Celestia says she would not have to punish her in any way, and decrees that Twilight, or any of her friends, only have to send friendship reports when they have something to write about.", "subseason_ep_number": "03", "absolute_ep_number": "29", "title": "Lesson Zero", "writer": "Meghan McCarthy", "release_date": "2011-10-15"}, {"synopsis": "Princess Luna, who had been saved by Twilight and her friends from her evil alter ego, Nightmare Moon, visits Ponyville on the festival of Nightmare Night, which centers around Nightmare Moon. The townsfolk all panic at her appearance and outdated mannerisms, but Twilight helps her to acclimate to the festival. Despite this, Pinkie Pie and several foals still run away at her approach, angering her into threatening to cancel the celebration forever. Twilight learns from Pinkie that she is just having fun being scared, so she uses this to show Luna that the foals love her but want to have fun being scared on that night. Heartened by this revelation, Luna happily joins in the rest of the festival.", "subseason_ep_number": "04", "absolute_ep_number": "30", "title": "Luna Eclipsed", "writer": "M. A. Larson", "release_date": "2011-10-22"}, {"synopsis": "Sweetie Belle is staying with Rarity while their parents are on vacation. Not used to Rarity's work, Sweetie Belle gets in the way and ruins Rarity's efforts. When Apple Bloom tells Sweetie Belle about the upcoming Sisterhooves Social race, she tries to get Rarity to participate, but she refuses. Sweetie Belle then angrily declares that Rarity is no longer her sister, and goes to stay with Apple Bloom and Applejack, considering her to be a better sister. Rarity realizes her selfishness and works out a plan with Applejack and Apple Bloom for the social. At the race, Rarity switches places with Applejack using a mud pit. When Sweetie Belle finds out that Rarity actually raced with her, she is overjoyed and they make up.", "subseason_ep_number": "05", "absolute_ep_number": "31", "title": "Sisterhooves Social", "writer": "Cindy Morrow", "release_date": "2011-11-05"}, {"synopsis": "After the Cutie Mark Crusaders failed to get their cutie marks in bowling, Apple Bloom dejectedly wanders into the Everfree Forest. But when she trips over and chips her tooth, Zecora takes Apple Bloom to her house to get it fixed. Apple Bloom finds a \"Heart's Desire\" flower which can make \"talent come into view\". While she believes it could help her finally discover her special talent, Apple Bloom instead becomes afflicted with the Cutie Pox, an ailment that causes various cutie marks to appear on her body, and forcing her to continually perform the talents they represent. Zecora arrives to find where her Heart's Desire went, and upon seeing Apple Bloom, provides her with the cure after Apple Bloom admits to taking the flower. Apple Bloom apologizes and realizes she cannot rush finding her talent.", "subseason_ep_number": "06", "absolute_ep_number": "32", "title": "The Cutie Pox", "writer": "Amy Keating Rogers", "release_date": "2011-11-12"}, {"synopsis": "After seeing the rest of her friends out in the park on a playdate with their pets, Rainbow Dash, with the help of Fluttershy, tries to find herself an animal to be her pet using a series of contests. However, Fluttershy insists that a tortoise should compete in the competition as well. After a series of events, Rainbow Dash challenges the four flying finalists to a race through Ghastly Gorge, so whichever one crosses the finish line with her will be her new pet. In the race, Rainbow Dash's wing is caught under a rock, but the tortoise, who had continued to race, arrives to help free and take her to the finish line. Rainbow Dash is proud to call the tortoise her new pet and names him Tank due to his tenacity.", "subseason_ep_number": "07", "absolute_ep_number": "33", "title": "May the Best Pet Win!", "writer": "Charlotte Fullerton", "release_date": "2011-11-19"}, {"synopsis": "After saving ponies in dangers several times, Rainbow Dash becomes a hero around Ponyville, but she lets the publicity go to her head, and her friends become concerned. Later, Rainbow Dash finds that she is being upstaged by a masked hero, Mare Do Well, who appears to be a winged unicorn. Angered by the competition, Rainbow Dash chases Mare Do Well only to discover that all of her friends had a role in playing Mare Do Well. They had worked out this plan to help show Rainbow Dash the dangers of letting praise go to one's head, and she thanks them for revealing her folly.", "subseason_ep_number": "08", "absolute_ep_number": "34", "title": "The Mysterious Mare Do Well", "writer": "Merriwether Williams", "release_date": "2011-11-26"}, {"synopsis": "Rarity is in Canterlot to design a dress for Twilight's upcoming birthday. When members of the elite class snub her Ponyville background, she is convinced that she can demonstrate high fashion. She runs into another upper-class unicorn, Fancy Pants, who invites her to a high class event. This soon builds too many more invitations to other fancy events for Rarity, leaving her torn between attending the events or finishing the half-completed dress. She decides to stay in Canterlot to mingle with the upper class and is surprised when Twilight and her friends arrive and have moved the birthday party to Canterlot. At Twilight's party, Rarity attempts to sneak out to a fancy garden party next door, but when her friends discover this, they support her networking for her business and decide to join the party as well. The socialites are initially shocked by their behavior, but Rarity stands up for her friends. Fancy Pants finds her friends \"charmingly rustic\" and compliments Rarity on Twilight's simple dress, assuring her more orders from the other upper class.", "subseason_ep_number": "09", "absolute_ep_number": "35", "title": "Sweet and Elite", "writer": "Meghan McCarthy", "release_date": "2011-12-03"}, {"synopsis": "Spike celebrates his first birthday in Ponyville, and is surprised at the number of gifts he has received from his new friends. However, this triggers a hoarding instinct in him, and the next day, Twilight is shocked to find that he has grown larger. Twilight learns that as a dragon becomes more greedy, it will grow to larger and larger sizes. Spike's greed soon runs out of control, and as a giant dragon, he kidnaps Rarity and climbs a nearby mountain. When Spike sees Rarity wearing a fire ruby gemstone, he remembers when he had willingly given it to Rarity before his birthday. The generous thoughts reverse his growth, returning him to normal. Despite the damage his rampage has done to Ponyville, Rarity still thinks of Spike as the most generous dragon she knows.", "subseason_ep_number": "10", "absolute_ep_number": "36", "title": "Secret of My Excess", "writer": "M. A. Larson", "release_date": "2011-12-10"}, {"synopsis": "Twilight and her friends are asked by Princess Celestia to be the principal actresses in a holiday pageant on the origins of Hearth's Warming Eve. The play shows that before Celestia's rule, the three races of ponies did not live in harmony. When a severe winter ruins most of the food, the three leaders and their assistants set off to find a new land untouched by winter. By chance, they all come to the same spot and the leaders start bickering again. The hostility feeds the ghostly Windigos, the creatures responsible for the winter, causing the land and the leaders to freeze over. The assistants find that they share a common bond and their friendship creates a great fire that vanquishes the Windigos and thaws out the land and their leaders. Putting their differences aside, the three tribes name the new land Equestria and work together to make it thrive.", "subseason_ep_number": "11", "absolute_ep_number": "37", "title": "Hearth's Warming Eve", "writer": "Merriwether Williams", "release_date": "2011-12-17"}, {"synopsis": "Apple Bloom is scheduled to bring a family member to school for Family Appreciation Day, but with the lucrative Zap Apple harvest nearing, only Granny Smith is available, and Apple Bloom worries that she will be embarrassed by Granny's antics in front of her class, particularly Diamond Tiara. She, along with Sweetie Belle and Scootaloo, try a number of tactics to stall Granny, without success. To their surprise, Granny recounts how she, as a filly, had discovered the Zap Apple trees and their unusual magic properties, leading to the formation of Ponyville. The rest of the class is awed by the story, and when Diamond Tiara tries to dismiss it, Apple Bloom stands up for Granny. In the end, Apple Bloom has a new appreciation of her grandmother's eccentric ways while Diamond Tiara is forced to participate by her father as punishment for insulting Granny, his most important produce supplier.", "subseason_ep_number": "12", "absolute_ep_number": "38", "title": "Family Appreciation Day", "writer": "Cindy Morrow", "release_date": "2012-01-07"}, {"synopsis": "Mr. and Mrs. Cake give birth to a pair of twins: Pound Cake, a pegasus, and Pumpkin Cake, a unicorn. A month after their birth, the Cakes are forced to ask Pinkie Pie to babysit the twins while they cater an event. Pinkie, initially happy to be able to play with the babies, finds that they are much more difficult to tend to, but she refuses to accept Twilight's help, believing she can show responsibility. However, when the twins later exhibit their flying and magic abilities, Pinkie can no longer control them and breaks down in tears. The twins realize their mistake and cheers Pinkie up. Mr. and Mrs. Cake return to find everything is fine, and offer Pinkie to be their go-to babysitter in the future, which Pinkie accepts after hearing the twins say her name.", "subseason_ep_number": "13", "absolute_ep_number": "39", "title": "Baby Cakes", "writer": "Charlotte Fullerton", "release_date": "2012-01-14"}, {"synopsis": "Applejack goes to the Equestria rodeo with plans to donate her winnings to repair the town hall. However, when she fails to return and only sends a note that says she will be back later, Twilight and her friends go off to look for her, finding her working on a cherry farm in Dodge Junction. Applejack refuses to answer their questions of why she did not return, but after suffering from Pinkie Pie's hyperactivity, she agrees to tell them the next day. That morning, they find Applejack is trying to escape. After a chase, they catch up with her to discover that while she had won events at the rodeo, none of her wins were first place, and she instead hoped to earn money as she had no prize money to return with. Her friends assure that they would rather have her back home than a fixed town hall, and Applejack happily returns to Ponyville.", "subseason_ep_number": "14", "absolute_ep_number": "40", "title": "The Last Roundup", "writer": "Amy Keating Rogers", "release_date": "2012-01-21"}, {"synopsis": "Cider season has arrived, but the Apples cannot make apple cider fast enough by traditional methods to satisfy everypony. Suddenly, traveling salesponies Flim and Flam arrive with their \"Super Speedy Cider Squeezy 6000\", claiming they can make as good a cider in a faster time. When the Apples refuse to accept a lopsided partnership, Flim and Flam instead challenge them to a cider making contest for rights to sell cider to Ponyville. The contest starts with the brothers in a strong lead, but Applejack's friends offer their help to speed up production. As their lead was quickly diminishing, Flim and Flam disable the quality control to speed up their machine. The brothers ultimately win the contest with the most barrels of cider, but the cider is undrinkable and they quickly flee. With all of their cider made in the contest, the Apples celebrate with everypony else in town.", "subseason_ep_number": "15", "absolute_ep_number": "41", "title": "The Super Speedy Cider Squeezy 6000", "writer": "M. A. Larson", "release_date": "2012-01-28"}, {"synopsis": "Rainbow Dash ends up in the hospital with a broken wing. Twilight offers her a book from the Daring Do novels, but Rainbow Dash refuses, considering reading to be an \"egghead\" hobby. However, she soon gets bored and starts reading the book, soon becoming engrossed in the adventure story. Just as she nears the conclusion, she is discharged from the hospital. Worried about revealing her newfound reading hobby to anypony else, she tries to sneak into the hospital to get the book, but ends up being chased around town by the hospital staff at night, waking up her friends. Rainbow Dash admits to enjoying the book, and Twilight is only happy to share her copies with her.", "subseason_ep_number": "16", "absolute_ep_number": "42", "title": "Read It and Weep", "writer": "Cindy Morrow", "release_date": "2012-02-04"}, {"synopsis": "After their consideration, the Cutie Mark Crusaders attempt to create a relationship between their schoolteacher Cheerilee and Apple Bloom's older brother Big Mac, for Hearts and Hooves Day with a love potion. However, they discover that the recipe is for a love poison, making them unable to do anything else beyond thinking about the other. The Crusaders barely manage to keep them out of eyesight of each other for an hour, breaking the spell. They apologize to Cheerilee and Big Mac, and as punishment, they take up Big Mac's chores for the entire day.", "subseason_ep_number": "17", "absolute_ep_number": "43", "title": "Hearts and Hooves Day", "writer": "Meghan McCarthy", "release_date": "2012-02-11"}, {"synopsis": "When a new resident named Cranky Doodle Donkey comes to Ponyville, Pinkie Pie attempts to befriend him, but Cranky refuses to become friends with her no matter how hard she tries. When Pinkie accidentally sets fire to Cranky's scrapbook, Cranky demands her to leave him alone and refuses to accept her apology. However, his outcries and the scrapbook give Pinkie an idea to which she reunites Cranky with another donkey that lives in Ponyville named Matilda. Cranky is amazed to see his love after having lost track of her after a Grand Galloping Gala years ago to which he happily thanks Pinkie and finally calls her his friend, much to Pinkie's happiness.", "subseason_ep_number": "18", "absolute_ep_number": "44", "title": "A Friend in Deed", "writer": "Amy Keating Rogers", "release_date": "2012-02-18"}, {"synopsis": "Fluttershy is told by Pinkie Pie and Rarity that she is too much of a doormat, letting others take advantage of her. She attends a self-help seminar run by a minotaur named Iron Will where she learns to become more assertive in her actions, but these lessons change Fluttershy's personality dramatically beyond recognition. When Pinkie and Rarity try to convince her to be less assertive, she insults them, making them run off in tears. Fluttershy becomes ashamed of herself and hides in her cottage. When Iron Will comes around to collect payment on the seminar, Pinkie and Rarity try to stop him, fearing that Fluttershy will crumble at his demand. Instead, to their surprise, Fluttershy explains she is not satisfied with Iron Will's course, and refuses to pay as per his guarantee. Iron Will is stunned but accepts this reason, and Pinkie and Rarity praise Fluttershy for being assertive while remaining herself.", "subseason_ep_number": "19", "absolute_ep_number": "45", "title": "Putting Your Hoof Down", "writer": "Merriwether Williams; story by Charlotte Fullerton", "release_date": "2012-03-03"}, {"synopsis": "While worrying about planning her next monthly schedule, Twilight is briefly visited by her bedraggled future self, who tries to warn her about something that would happen next Tuesday morning, but her interruptions prevent \"Future Twilight\" from explaining what to be prepared for before she disappears. Twilight fears the worst and tries to take steps to prevent it. However, while nothing bad happens, Twilight suffers minor injuries that mirror her future self's look. Convinced that the only way to prevent the disaster is to stop time, she, Pinkie Pie, and Spike go to the Canterlot library to look for time-stopping spells, but when Tuesday morning arrives, nothing happens. Using a time travel spell found by Pinkie, Twilight travels back a week to tell her past self that she has nothing to worry about, realizing this is the warning \"Future Twilight\" tried giving her to begin with.", "subseason_ep_number": "20", "absolute_ep_number": "46", "title": "It's About Time", "writer": "M. A. Larson", "release_date": "2012-03-10"}, {"synopsis": "After observing the Great Dragon Migration with his friends, Spike starts to question his dragon roots. He then sets out to join the dragon migration on a quest of self discovery but Twilight, Rarity, and Rainbow Dash know he will need help and tail him in a hastily made dragon costume. At a volcano, Spike joins teenage dragons who challenge him to prove that he is a dragon. With some help from his friends, Spike shows off his worth. Later, the dragons attempt to raid a nest of phoenix eggs using Spike to lure the phoenixes away. Spike returns to find an unhatched egg remaining, but refuses to smash it. His friends reveal themselves and help rescue Spike and the egg. Later in Ponyville, Spike hatches the egg, names the new phoenix chick \"Peewee\" and promises to take good care of it.", "subseason_ep_number": "21", "absolute_ep_number": "47", "title": "Dragon Quest", "writer": "Merriwether Williams", "release_date": "2012-03-17"}, {"synopsis": "Ponyville's pegasi are challenged to create a tornado to move water from their reservoir to Cloudsdale for the rainy season. Rainbow Dash wants all the pegasi to improve their speed to beat the record, but finds that Fluttershy suffers from public anxiety from her time at flight school. Fluttershy tries to train on her own with her animal friends. While she does improve, her performance is far worse than the other pegasi, and she runs off. On the day of the attempt, a number of pegasi have come down with a flu, and they barely have enough to ensure that the tornado can be made successfully. After a botched first attempt, their second tornado falls just short of the necessary speed. Twilight convinces Fluttershy to help the other pegasi and she is able to dispel her fears long enough to give enough speed to complete the tornado. Rainbow Dash and the other pegasi cheer Fluttershy on as their hero.", "subseason_ep_number": "22", "absolute_ep_number": "48", "title": "Hurricane Fluttershy", "writer": "Cindy Morrow", "release_date": "2012-03-24"}, {"synopsis": "The Cutie Mark Crusaders join the school newspaper in their attempts to earn their cutie marks. Diamond Tiara, the paper's editor, wants the paper to be more exciting and has the Crusaders write a gossip column under the pen name \"Gabby Gums\". The column becomes a huge success, but Diamond Tiara makes the Crusaders conjure untruths and expose embarrassing secrets of all the other townsfolk, including their own friends and families. Realizing that getting their cutie marks is not worth the pain and misery they spread by not valuing others' privacy, the Crusaders try to quit, but Diamond Tiara threatens to publish humiliating photos of them if they fail to find another story. When Rarity discovers the truth about Gabby Gums, the Crusaders are shunned by all of Ponyville, making their search for stories difficult. The Crusaders come up with a plan to write an apology letter to the town, successfully submitting it without Diamond Tiara's knowledge to publish at the deadline. The townsfolk accept their apology, while Diamond Tiara is demoted to operating the printing press.", "subseason_ep_number": "23", "absolute_ep_number": "49", "title": "Ponyville Confidential", "writer": "M. A. Larson", "release_date": "2012-03-31"}, {"synopsis": "Pinkie Pie is in charge of guarding the Cakes' dessert for a competition in Canterlot. She and her friends share the train with three rival bakers who have brought their own entries. Overnight, the Cakes' dessert is partially eaten. Pinkie immediately accuses the other bakers, but Twilight instead shows her how to investigate, and finds clues that point to their friends, Rainbow Dash, Fluttershy, and Rarity, each admitting to taking a taste. The other bakers' desserts are similarly eaten, but Pinkie, using Twilight's advice, deduces that the bakers had eaten each others' desserts after hearing Pinkie's delicious descriptions of them. The collected group use the remains of the desserts to create a single entry that wins the competition.", "subseason_ep_number": "24", "absolute_ep_number": "50", "title": "MMMystery on the Friendship Express", "writer": "Amy Keating Rogers", "release_date": "2012-04-07"}, {"synopsis": "Twilight and her friends are summoned to plan a wedding for Shining Armor, Twilight's older brother and captain of the royal guard at Canterlot, and Princess Cadance, her childhood foal-sitter. Twilight becomes suspicious of Cadance when she fails to remember her, and even more so when Cadance continually puts down all of her friends. When they refuse to listen to Twilight's accusations, she attempts to warn Shining Armor, only to witness Cadance place a seemingly evil spell on him. Twilight confronts Cadance at the wedding rehearsal, causing her to break down in tears. Furious, Shining Armor bans Twilight from the wedding, while her friends and Princess Celestia leave her to reflect on her actions. When Twilight tries to apologize to Cadance, she uses a magic spell that teleports Twilight underground.", "subseason_ep_number": "25", "absolute_ep_number": "51", "title": "A Canterlot Wedding - Part 1", "writer": "Meghan McCarthy", "release_date": "2012-04-21"}, {"synopsis": "After being trapped in the caves beneath Canterlot by Cadance, Twilight encounters another Cadance and learns that the Cadance who Shining Armor is about to marry is actually an impostor. Twilight and the real Cadance escape in time to stop the wedding, where Cadance exposes the impostor as Queen Chrysalis, the leader of the shape-shifting changelings. Chrysalis reveals her plan to invade Canterlot, for she has taken over Shining Armor's mind and weakened his magic shield that protects the city. She is able to defeat Princess Celestia, and her army prevents Twilight and her friends from retrieving the Elements of Harmony to stop her. As Chrysalis celebrates her victory, Twilight frees Cadance, who frees Shining Armor from Chrysalis's spell. Together, Shining Armor and Cadance use their magic to repel Chrysalis and her army. The wedding goes on as scheduled, and Twilight is heralded as a hero by her brother and friends for trusting her instincts.", "subseason_ep_number": "26", "absolute_ep_number": "52", "title": "A Canterlot Wedding - Part 2", "writer": "Meghan McCarthy", "release_date": "2012-04-21"}], [{"synopsis": "Princess Celestia learns of the return of the Crystal Empire, which had disappeared over a thousand years ago by its former tyrannical unicorn ruler, King Sombra, before he was banished. Celestia fears Sombra will return and use the city's power to take over Equestria. She summons Twilight and instructs her to join her friends, Shining Armor, and Princess Cadance at the city to help protect it as a test of her abilities. At the city, Cadance attempts to maintain a spell to prevent the shadowy form of Sombra from entering. Twilight and her friends talk with the city's residents, the Crystal Ponies, and learn of a Crystal Fair which used to enlighten the hearts of the city and protect it from Sombra, with a Crystal Heart as the centerpiece, but they soon discover that the Crystal Heart is a necessary artifact to protect the city.", "subseason_ep_number": "01", "absolute_ep_number": "53", "title": "The Crystal Empire - Part 1", "writer": "Meghan McCarthy", "release_date": "2012-11-10"}, {"synopsis": "With Cadance's magic weakening, Twilight instructs her friends to continue the fair to raise the spirits of the Crystal Ponies while she goes to look for the Crystal Heart by herself, assured this is the test Princess Celestia alluded to. However, she allows Spike to come along. They pass several traps Sombra had placed in the castle and eventually come to the Crystal Heart, just as Cadance's magic gives out and Sombra races to reclaim the city. Twilight moves on to recover the heart, but walks into a trap, telling Spike to take the heart in her place. On his way down, Spike falls, but he and the heart are saved at the last moment by Shining Armor and Cadance. The Crystal Ponies pour their emotions into the heart, recreating the protective spell on the city and obliterating Sombra. Twilight returns to Canterlot, convinced she has failed her test, but Celestia tells her that she has passed, knowing when to give up her personal goals for the greater good.", "subseason_ep_number": "02", "absolute_ep_number": "54", "title": "The Crystal Empire - Part 2", "writer": "Meghan McCarthy", "release_date": "2012-11-10"}, {"synopsis": "Pinkie Pie is torn between spending fun time with all her friends, leading her to locate the Mirror Pool, which allows her to make a clone of herself. When she finds herself further conflicted over which friends to spend time with, she and her clone return to the pool and reiterate the process, but the clones begin to clone themselves further. The mass number of Pinkies, intent on only having fun, overwhelm Ponyville, and Pinkie becomes depressed that her friends cannot figure out who the real Pinkie is. Twilight puts the clones to a test of watching paint dry, zapping away those that lose attention, and assuring that the last remaining Pinkie is the real one.", "subseason_ep_number": "03", "absolute_ep_number": "55", "title": "Too Many Pinkie Pies", "writer": "Dave Polsky", "release_date": "2012-11-17"}, {"synopsis": "Apple Bloom's cousin Babs Seed from Manehatten comes to visits Ponyville. When Apple Bloom, Sweetie Belle, and Scootaloo try to welcome her into the Cutie Mark Crusaders, Babs instead joins Diamond Tiara and Silver Spoon in teasing and hounding them. The Crusaders try to get back at her by booby-trapping a parade float that they trick Babs into driving, but learn from Applejack after the deed that the reason Babs is visiting is that she was bullied by others back in Manehattan. The Crusaders save Babs, and together apologize for their actions. Babs joins the Crusaders and defends her new friends from Diamond Tiara and Silver Spoon at the train station before returning home.", "subseason_ep_number": "04", "absolute_ep_number": "56", "title": "One Bad Apple", "writer": "Cindy Morrow", "release_date": "2012-11-24"}, {"synopsis": "While Twilight practices her magic for Princess Celestia’s visit with delegates from Saddle Arabia, Trixie returns to exact revenge on her after her last visit to Ponyville and acquires the Alicorn Amulet, a magical artifact that gives her great power. She defeats Twilight in a magical duel and banishes her from Ponyville. Twilight goes to see Zecora, who offers to help her beat Trixie. While Trixie takes over Ponyville, Twilight’s friends discover that the amulet also corrupts its user and only the user can remove it, and they send Fluttershy to tell Twilight. Challenging Trixie to a rematch, Twilight secretly arranges with Zecora and her friends to perform simple illusions disguised as more powerful magic with a fake charm, making Trixie take off the amulet willingly to try the charm, breaking its spell on her. Once the amulet is secured, Trixie apologizes for her behavior.", "subseason_ep_number": "05", "absolute_ep_number": "57", "title": "Magic Duel", "writer": "M. A. Larson", "release_date": "2012-12-01"}, {"synopsis": "Scootaloo joins Apple Bloom and Sweetie Belle and their sisters on a camping trip, hoping to show off her skills to her idol, Rainbow Dash. After a night of telling scary tales by a campfire, Scootaloo has nightmares, but refuses to let anypony else know, worried this will ruin her image with Rainbow Dash. During another nightmare, she encounters Princess Luna, who tells her that her fears are not that of the scary stories but of disappointing Rainbow Dash, and she should face that fear. After Rainbow Dash saves her from falling over a waterfall, Scootaloo admits her fears to her. To her surprise, Rainbow Dash admits that she used to be scared of the same stories as a young filly and agrees to become Scootaloo's older sister figure.", "subseason_ep_number": "06", "absolute_ep_number": "58", "title": "Sleepless in Ponyville", "writer": "Corey Powell", "release_date": "2012-12-08"}, {"synopsis": "Rainbow Dash is accepted into the Wonderbolt Academy, led by Spitfire, and quickly becomes friends with Lightning Dust, another pegasus who is as fast and skilled as her, but is more reckless. Rainbow Dash is surprised to find she is assigned as \"wingpony\" to Lightning Dust and becomes concerned when her aggressive approach endangers the other cadets. When Lightning Dust decides to create a tornado during a cloud-clearing exercise, the tornado threatens to harm Rainbow Dash's friends, who have come by to give her a care package. Once she saves her friends, Rainbow Dash decides to quit the academy, disgusted by the Wonderbolts' apparent approval of Lightning Dust's recklessness. However, Spitfire agrees with Rainbow Dash and persuades her to stay by stripping Lightning Dust of her rank and promoting Rainbow Dash to cadet team leader.", "subseason_ep_number": "07", "absolute_ep_number": "59", "title": "Wonderbolts Academy", "writer": "Merriwether Williams", "release_date": "2012-12-15"}, {"synopsis": "The Apple family reunion is approaching, and Applejack offers to take over the event's organization from Granny Smith after going through photos of past reunions. Though Applejack's planned activities are in the spirit of the reunion, the events are long and rigorous, leaving all the guests exhausted. When a wild hayride destroys the barn, Applejack realizes that she has focused too hard on the event planning and not on the real purpose of the reunion: to be with friends and family. She gets an idea and has everypony join in to help rebuild the barn, which everyone is happy to help contribute to, thus making the reconstruction a memorable event of the reunion.", "subseason_ep_number": "08", "absolute_ep_number": "60", "title": "Apple Family Reunion", "writer": "Cindy Morrow", "release_date": "2012-12-22"}, {"synopsis": "After stopping a hot-air balloon from floating away, Spike got attacked by timberwolves in the Everfree Forest. When Applejack saves him, Spike insists on helping her around the farm in order to repay a life debt that is customary to dragons. His efforts only make trouble for her and the other ponies, and they set up a fake timberwolf attack for Spike so that he can save Applejack from, thus making him feel satisfied with his debt. Their ruse draws a pack of real timberwolves, which Applejack easily crushes, but the pieces form into a single giant beast and she gets caught in a rockslide. Spike causes the timberwolf to fall apart by throwing a rock down its throat and frees Applejack. Afterwards, Applejack convinces Spike to give up his debt.", "subseason_ep_number": "09", "absolute_ep_number": "61", "title": "Spike at Your Service", "writer": "Merriwether Williams; story by Dave Polsky", "release_date": "2012-12-29"}, {"synopsis": "Princess Celestia orders Twilight and her friends to release and reform Discord, believing Fluttershy will know how to do it best. While the rest of her friends are doubtful at the thought, Fluttershy remains calm and attempts to befriend Discord. When the others discover that Discord created chaos behind their backs, they demand Fluttershy to use her Element of Harmony to return him to stone, but she stands firm and promises not to use her Element against him as a sign of their newfound friendship. When Discord refuses to relent, she angrily walks away, still refusing to use her Element against him, but also ending their friendship. Realizing he never had a friend before in his life, a remorseful Discord realizes that he truly does value Fluttershy's friendship and does not want to lose it. With this revelation, Discord reverts his chaos and regains Fluttershy's trust, voluntarily offering to permanently use his powers for good, much to the others and Celestia's delight.", "subseason_ep_number": "10", "absolute_ep_number": "62", "title": "Keep Calm and Flutter On", "writer": "Dave Polsky; story by Teddy Antonio", "release_date": "2013-01-19"}, {"synopsis": "When Spike runs out of gems to use for a cake, he comes up with a scheme of pet-sitting for Twilight and her friends while they are off to the Crystal Empire in exchange for gems. Unfortunately, Spike finds the task daunting than he expected and has no time to mix the gems into his cake in which ends up spending his gems as an attempt to restrain the pets. When he, along with the pets and the Cutie Mark Crusaders accidentally board the train to the Crystal Empire, Spike fears being exposed as a fraud when he admits to the pets that he put himself over their needs. The pets then cooperate and stay quiet until the train returns to Ponyville, where Spike happily returns the pets to their owners. However, he absentmindedly eats the last gem before using it for his cake.", "subseason_ep_number": "11", "absolute_ep_number": "63", "title": "Just for Sidekicks", "writer": "Corey Powell", "release_date": "2013-01-26"}, {"synopsis": "Occurring in the same storyline as \"Just for Sidekicks\", Princess Cadance asks Twilight and her friends to help prepare the Crystal Empire for the arrival of the games inspector Ms. Harshwhinny, hoping to have the city host the next Equestria Games. With the inspector due to arrive earlier than expected, Cadance must spend time preparing herself styling her ceremonial headdress with Rarity's help and asks the others to greet and give a tour to the inspector. They mistake a tourist as the inspector and give her a grand tour, while the real Ms. Harshwhinny finds herself subject to a number of accidental missteps. By the time the group realize their error, Ms. Harshwhinny has met with the tourist and learns of how great a time she had. Despite her own misfortunes, Ms. Harshwhinny announces the Crystal Empire as the next host city.", "subseason_ep_number": "12", "absolute_ep_number": "64", "title": "Games Ponies Play", "writer": "Dave Polsky", "release_date": "2013-02-09"}, {"synopsis": "Princess Celestia gives Star Swirl the Bearded's notebook to Twilight, which contains an unfinished spell that she thinks Twilight can complete. When Twilight recites the spell, it causes her friends, through the Elements of Harmony, to have their cutie marks and respective destinies switched, resulting in disasters around Ponyville. Twilight finds a means to convince each of her friends of their proper place with the help of the Elements, restoring her friends to normal, and is able to complete Star Swirl's spell by accounting for her friendships. When she does so, Twilight is teleported by the Elements to an ethereal place, where Celestia congratulates her on completing her journey, and helps her transform into an alicorn and crowns her as a new princess. Twilight's ascension is celebrated by her friends and across Equestria.", "subseason_ep_number": "13", "absolute_ep_number": "65", "title": "Magical Mystery Cure", "writer": "M. A. Larson", "release_date": "2013-02-16"}], [{"synopsis": "Twilight struggles to adjust to her new wings and duties as a princess while she prepares for the Summer Sun Celebration away from her friends. Shortly after consoling Twilight that night, Princess Celestia is attacked by a black vine. Twilight awakens the next morning to find that Celestia and Luna have disappeared, leaving the sun and moon hanging in the sky, now split between day and night. In addition, the castle guards inform her of an overgrowth of black vines from the Everfree Forest near Ponyville. Returning to Ponyville to gather the Elements of Harmony, Twilight and her friends suspect Discord is responsible and summon him for answers, but he claims to be innocent. The ponies consult Zecora who, having abandoned the forest, gives Twilight a potion she says will help her learn what is causing the havoc. After drinking the potion, Twilight finds herself in an unfamiliar castle with Princess Luna, who transforms into Nightmare Moon.", "subseason_ep_number": "01", "absolute_ep_number": "66", "title": "Princess Twilight Sparkle - Part 1", "writer": "Meghan McCarthy", "release_date": "2013-11-23"}, {"synopsis": "Twilight realizes that Luna's transformation is a vision of the past caused by Zecora's potion. Further flashbacks allow her to witness Celestia and Luna's discovery of the Elements of Harmony at the mystical Tree of Harmony in the Everfree Forest. Twilight and her friends enter the forest with the Elements, believing the tree to be in danger. Twilight is soon sent away by her friends as they grow concerned for her safety, but rejoins them after Discord mocks her for putting herself before her friends. Finding the tree entangled by the vines, Twilight deduces that it needs the Elements to survive and returns them to the tree, eradicating the vines and freeing Celestia and Luna. The tree then sprouts a flower containing a chest with six keyholes, mystifying the ponies. Back in Ponyville, Discord admits to sowing the vines shortly before his original defeat in a delayed plot to plunder the tree's magic and he claims to have deliberately withheld this so Twilight would learn how to be a proper leader. The Summer Sun Celebration then commences, with Twilight participating before her cheering friends.", "subseason_ep_number": "02", "absolute_ep_number": "67", "title": "Princess Twilight Sparkle - Part 2", "writer": "Meghan McCarthy", "release_date": "2013-11-23"}, {"synopsis": "Twilight goes to Princess Celestia and Princess Luna's old castle to research the chest from the Tree of Harmony, finding a diary kept by the sisters that explains the workings of the castle. Meanwhile, Applejack and Rainbow Dash challenge each other to stay the night in the castle, which they believe is haunted by the Pony of Shadows, while Rarity takes Fluttershy along to the castle to look for old tapestries to repair. They all accidentally get into several hijinks of traps and devices triggered by themselves, as well as an unknown pony playing on the castle's organ, thought to be the Pony of Shadows. Twilight finds them all in a state of panic and calms them down, and together they find the organ player to be Pinkie Pie, who had followed her friends to the castle, thinking there would be a party.", "subseason_ep_number": "03", "absolute_ep_number": "68", "title": "Castle Mane-ia", "writer": "Josh Haber", "release_date": "2013-11-30"}, {"synopsis": "Upon learning that the next Daring Do book has been delayed, Rainbow Dash insists that she and her friends should help the author of the books, A.K. Yearling, to finish the book faster. Arriving at Yearling's cabin, the group witness the author fighting a group of thugs and discover her to be Daring Do herself. Rainbow Dash is eager to help Daring Do and follows her but Daring Do insists she works alone and turns her away. In her excitement, Rainbow Dash accidentally ruins Daring Do's plan to retrieve a mystical ring from the thugs resulting in her getting captured by her nemesis Ahuizotl, who takes the ring to a nearby temple in order to activate a doomsday device. Rainbow Dash and her friends then come to Daring Do's rescue and together they destroy the temple and thwart Ahuizotl's plans. As a result, Daring Do appreciates Rainbow Dash's help and writes her into her next book as thanks.", "subseason_ep_number": "04", "absolute_ep_number": "69", "title": "Daring Don't", "writer": "Dave Polsky", "release_date": "2013-12-07"}, {"synopsis": "The foals in Ponyville compete under Rainbow Dash's coaching to be the town's flag carrier for the upcoming Equestria Games. The Cutie Mark Crusaders put together an impressive routine that showcases how all three races of pony live harmoniously in Ponyville. Diamond Tiara and Silver Spoon, who are also participating, attempt to sabotage the event by pointing out Scootaloo's inability to fly at her age. Annoyed, Scootaloo changes the routine to focus more on her flying and spends all her time practicing, exhausting Apple Bloom and Sweetie Belle. Scootaloo eventually loses hope of ever flying and drops out. When Rainbow Dash finds out, she takes Apple Bloom and Sweetie Belle to Scootaloo's home and reinforces the idea that their presentation is not about her ability to fly, but the friendships between the three of them. Scootaloo rejoins her friends, and they win the competition.", "subseason_ep_number": "05", "absolute_ep_number": "70", "title": "Flight to the Finish", "writer": "Ed Valentine", "release_date": "2013-12-14"}, {"synopsis": "Spike finds himself unneeded while his friends clean up Princess Celestia and Princess Luna's old castle, so he goes off to read a Power Ponies superhero comic issue, unaware that it possesses magical powers. When he reaches the end and reads the cryptic text on the last page, he and his friends are sucked into the comic book. In the comic, the ponies get transformed and assume the personas of the Power Ponies, while Spike is transformed into their bumbling sidekick, Hum Drum, to his annoyance. The ponies learn that they must defeat the supervillain Mane-iac in order to escape the comic, but their clumsiness with their newfound powers leaves all but Spike trapped. As the Mane-iac threatens them with her doomsday weapon, the ponies assert that Spike always comes through for them when they need him. Spike is able to use the distraction to trap the Mane-iac's henchmen and free the others, allowing them to stop the Mane-iac and safely return home to Equestria.", "subseason_ep_number": "06", "absolute_ep_number": "71", "title": "Power Ponies", "writer": "Meghan McCarthy, Charlotte Fullerton & Betsy McGowen", "release_date": "2013-12-21"}, {"synopsis": "Applejack discovers that vampire fruit bats have infested Sweet Apple Acres and rallies her friends to get rid of them before her orchard is destroyed. Fluttershy argues the long-term benefits posed by the bats' eating habits, but Applejack dismisses her. Fluttershy reluctantly helps her friends round up the bats and uses her Stare to keep them in place while Twilight applies a spell that eradicates their appetite for apples. The next morning, Applejack finds that her crops are still being eaten despite Twilight's spell still being in effect. During a stakeout, she and her friends identify the culprit as Fluttershy, who has turned into a bat/pony hybrid as an unintended side-effect of the spell. Fluttershy's friends lure her to a mirror using Applejack's prized apple intended for a county fair as bait, immobilizing her with her own Stare and allowing Twilight to reverse the spell. Applejack builds a sanctuary for the bats per Fluttershy's suggestion and apologizes for ignoring her.", "subseason_ep_number": "07", "absolute_ep_number": "72", "title": "Bats!", "writer": "Merriwether Williams", "release_date": "2013-12-28"}, {"synopsis": "Rarity participates in a fashion competition in the city of Manehattan, bringing her friends for support. She loans samples of her fabric to fellow competitor Suri Polomare out of generosity, only to find the next day that Suri and her aide Coco Pommel have used the fabric to recreate her entire line. Fearing she will be accused of copying Suri, Rarity pressures her friends into missing all their planned activities in order to help make another fashion line. Rarity's new line wins at the show, but she notices her friends' absence and is overcome with remorse. She reconciles with her friends while Suri lies that Rarity lost the show so as to keep the trophy for herself. Rarity later receives her trophy from Coco, who says that Rarity's generosity has inspired her to quit working for Suri. Coco also gives her a spool of rainbow-colored thread and is offered a new job with one of Rarity's connections in return.", "subseason_ep_number": "08", "absolute_ep_number": "73", "title": "Rarity Takes Manehattan", "writer": "Dave Polsky", "release_date": "2014-01-04"}, {"synopsis": "Pinkie Pie finds a genealogy scroll that suggests she and the Apple family are related, but the text confirming it is smudged beyond legibility. Applejack suggests a trip to their relative Goldie Delicious to find out for sure and cautions the rest of her immediate family to be on their best behavior for Pinkie. Though the trip starts out uneventful, complications arise once their wagon breaks down and forces them to travel down a river, where bickering between the Apples further stymies their travels until they are eventually redirected over a waterfall. The Apples and Pinkie nevertheless make it safely to Goldie's cabin but find that the necessary text in her family record book is also scrubbed out. Despite Pinkie's disappointment, Applejack considers her to still be family for being able to put up with their fighting and, like her own immediate ones, work out their differences for the better.", "subseason_ep_number": "09", "absolute_ep_number": "74", "title": "Pinkie Apple Pie", "writer": "Natasha Levinger", "release_date": "2014-01-11"}, {"synopsis": "Rainbow Dash leads the Ponyville team for a relay race to qualify for the Equestria Games. At the tryouts, she finds the Cloudsdale team is composed of the Wonderbolts Spitfire, Fleetfoot, and Soarin, and begins to doubt her less skilled teammates. After Soarin crashes and injures his wing, Spitfire and Fleetfoot goad Rainbow Dash into filling in for him. Rainbow Dash secretly splits practice between her friends and the Wonderbolts, but Twilight soon discovers her two-timing and urges her to choose a team. Rainbow Dash pretends to be injured to avoid making a decision but learns while in the hospital that even though Soarin has recovered, the Wonderbolts still want her as a replacement. Angered by their treatment of Soarin, Rainbow Dash reasserts her loyalty to Ponyville and rejoins her friends while also getting Soarin back on his old team. Rainbow Dash qualifies Ponyville for the games, and Spitfire respectfully gives her a Wonderbolt pin.", "subseason_ep_number": "10", "absolute_ep_number": "75", "title": "Rainbow Falls", "writer": "Corey Powell", "release_date": "2014-01-18"}, {"synopsis": "Princess Cadance visits Ponyville to spend the day with Twilight, who anticipates quiet bonding time with her sister-in-law. To Twilight's dismay, however, she and Cadance are both approached by Discord, who appears to have come down sick with the \"blue flu\", to which he badgers them into taking care of him while Fluttershy is away. His list of increasingly outlandish demands gets on Twilight's nerves until he finally asks them to make a cure from a flower that grows at the edge of Equestria. Twilight and Cadance recover the flower and fight off a giant Tatzlwurm guarding it, only to find upon returning that Discord had faked his illness in order to test how far Twilight was willing to go for his well-being. Despite this, Cadance injects by pointing out that she actually enjoyed their adventure as a change of pace from her boring royal duties. The Tatzlwurm suddenly reappears and sneezes on Discord, causing him to actually feel sick and for Fluttershy to take care of him upon returning to Ponyville.", "subseason_ep_number": "11", "absolute_ep_number": "76", "title": "Three's A Crowd", "writer": "Meghan McCarthy & Ed Valentine", "release_date": "2014-01-25"}, {"synopsis": "A party planner named Cheese Sandwich arrives in Ponyville on the same day Pinkie Pie is planning a \"birth-iversary\" party celebrating Rainbow Dash's birthday and anniversary of her move to Ponyville. The townsfolk, including the girls, are entranced by Cheese's partying and allow him to plan the festivities instead, leaving Pinkie dejected. Refusing to be outdone, Pinkie challenges Cheese to a \"goof-off\" to determine who will headline the party. However, Pinkie soon notices the strain that her prideful behavior is putting on Rainbow Dash and forfeits the match. Her friends go and apologize for making her feel neglected, but she instead counters that it is her fault. Cheese arrives and reveals that it was Pinkie who inspired him to become a party planner as a colt. Pinkie and Cheese work together to throw Rainbow Dash a spectacular party before Cheese departs, leaving Pinkie his favorite rubber chicken as a parting gift.", "subseason_ep_number": "12", "absolute_ep_number": "77", "title": "Pinkie Pride", "writer": "Amy Keating Rogers; story by Jayson Thiessen", "release_date": "2014-02-01"}, {"synopsis": "Rarity is elected to host the Ponyville Days festival, which she hopes will attract the attention of Trenderhoof, a travel writer whom she has been smitten by. Upon his arrival, Rarity takes Trenderhoof on a tour of Ponyville, but she becomes aghast when he falls for Applejack and her farming ways. Rarity forgoes her festival duties to help out on the farm in the hopes of attracting Trenderhoof's attention but is unable to sway him. As a last-ditch effort, Rarity changes her festival's elegant theme to a farming one, dressing and speaking like a farmer herself. Annoyed by her antics, Applejack impersonates Rarity in retaliation, causing Rarity to realize her own foolish behavior, apologize, and return to her original theme in time for the festival.", "subseason_ep_number": "13", "absolute_ep_number": "78", "title": "Simple Ways", "writer": "Josh Haber", "release_date": "2014-02-08"}, {"synopsis": "After listening to Fluttershy's amazing singing, her friends suggest that she should perform with the Pony Tones vocal quartet at a benefit concert, but she refuses due to her stage fright. When Big Mac loses his voice the day before he is to sing bass at the concert, Fluttershy agrees to sing his part backstage while Big Mac lip-syncs, taking a Poison Joke brew made by Zecora to recreate her masculine \"Flutterguy\" voice. The concert goes on perfectly, and Fluttershy insists to continue singing for Big Mac out of sight as she enjoys being able to sing. After Big Mac recovers his voice, Fluttershy asks to perform one last time, but accidentally reveals herself during the concert. She runs off in embarrassment, but her friends convince her that facing her worst fear was not as bad as she had imagined because the audience loved her performance. Fluttershy agrees to perform privately for her friends with the Pony Tones and permanently join the band once she fully overcomes her stage fright.", "subseason_ep_number": "14", "absolute_ep_number": "79", "title": "Filli Vanilli", "writer": "Amy Keating Rogers", "release_date": "2014-02-15"}, {"synopsis": "The Cutie Mark Crusaders are taking lessons under Twilight's mentorship in a weekly event called \"Twilight Time\". They decide to take Diamond Tiara and Silver Spoon as guests to their next lesson, wanting to one-up Diamond Tiara's showmanship at school, though they are more excited about meeting Twilight. Soon, all of the Crusaders' classmates befriend them, hoping to meet Twilight themselves. As the pressure mounts on the Crusaders, they are forced to bring them all to the next Twilight Time, where they realize that with all the attention they have received, they have forgotten to practice for their lessons. Twilight is disappointed to learn that the Crusaders have taken advantage of her popularity and adjourns Twilight Time. However, the Crusaders apologize for what they have done. Twilight forgives them and lets them continue their studies in secret from the other foals.", "subseason_ep_number": "15", "absolute_ep_number": "80", "title": "Twilight Time", "writer": "Dave Polsky", "release_date": "2014-02-22"}, {"synopsis": "Fluttershy and her friends help a flock of sprite-like breezies migrate through Ponyville by creating a breeze they need to fly on to reach their distant home before the portal to it closes in a few days' time. When a group accidentally gets separated from the rest of the flock, Fluttershy takes them in for the short while they need to rest before setting out again. The other breezies enjoy being in her care, and Fluttershy, not wanting to disappoint them, lengthens their stay. An abrasive breezie named Seabreeze desperately takes off on his own and runs into trouble with a swarm of bees, but Fluttershy comes to his aid by talking sternly to the bees. Realizing the dangers Ponyville poses for the breezies, Fluttershy firmly convinces them to depart. Finding the group too small to ride the breeze, Twilight uses a spell to transform her and her friends into breezies, allowing the collective group to reach the breezies' home in time. Seabreeze gives Fluttershy a flower and their thanks as the portal closes.", "subseason_ep_number": "16", "absolute_ep_number": "81", "title": "It Ain't Easy Being Breezies", "writer": "Natasha Levinger", "release_date": "2014-03-01"}, {"synopsis": "Apple Bloom's family agrees that she is old enough to stay alone at the farm while the three of them go on various errands, including pie deliveries, across Equestria. Shortly after leaving, Applejack has second thoughts and returns home, her sudden appearance startling Apple Bloom into making an accidental mess. Believing Apple Bloom caused the mess on her own, Applejack remains home to incessantly surveil her and childproof the entire farm. Annoyed with Applejack's pampering, Apple Bloom gets Sweetie Belle and Scootaloo to cover for her while she sneaks off and makes Applejack's pie deliveries for her to prove herself capable of being on her own. She encounters a hungry chimera in a swamp and does her best to protect herself and the pies until Applejack, upon discovering the ruse, arrives and rescues her. Surprised to see her sister managed to save the pies, Applejack stops babying Apple Bloom, and they finish the delivery together.", "subseason_ep_number": "17", "absolute_ep_number": "82", "title": "Somepony to Watch Over Me", "writer": "Scott Sonneborn", "release_date": "2014-03-08"}, {"synopsis": "Pinkie Pie is eager for her friends to meet her older sister Maud, whom she says has much in common with each of them. When Maud arrives, however, the girls find her to be a dull pony with an unusual interest in rocks and, despite their best efforts, fail to find any common interest with her. Upset by her friends' inability to befriend Maud, Pinkie decides to help them by constructing an obstacle course that combines all of their interests, including a giant pile of rocks for Maud. While demonstrating the course, Pinkie is nearly crushed by a boulder, but Maud rescues her. The girls realize that Maud cares for Pinkie as much as they do, so they apologize to both sisters and offer their friendship to Maud over their shared bond, which she accepts.", "subseason_ep_number": "18", "absolute_ep_number": "83", "title": "Maud Pie", "writer": "Noelle Benvenuti", "release_date": "2014-03-15"}, {"synopsis": "Sweetie Belle asks Rarity to help with her costumes for a stage play she put together herself. After the play, Sweetie Belle finds that Rarity's dresses garnered more praise than the play itself and accuses Rarity of upstaging her on purpose. The night before Rarity is to deliver outfits to Sapphire Shores in Canterlot, Sweetie Belle spitefully sabotages one of the pieces. Later that night, Sweetie Belle is visited in her dreams by Princess Luna, who uses visions of the past, present, and future to show Rarity's pure intentions to Sweetie Belle, and the horrific downward spiral she will undergo if Sweetie Belle's sabotage goes unchecked. Awakening to find Rarity has left for Canterlot, Sweetie Belle rushes after her with Apple Bloom and Scootaloo, and manages to repair the outfit with Luna's help before Rarity can present it. Sapphire is pleased with the dresses, and Sweetie Belle reconciles with Rarity.", "subseason_ep_number": "19", "absolute_ep_number": "84", "title": "For Whom the Sweetie Belle Toils", "writer": "Dave Polsky", "release_date": "2014-03-22"}, {"synopsis": "Flim and Flam return to Ponyville, selling a \"miracle curative tonic\" they claim can relieve anypony's ailments. After seeing one pony named Silver Shill get better on the spot after taking the drink, Granny Smith buys a bottle and finds herself able to pursue her old swimming hobbies from her youth. Applejack investigates the brothers' stage to discover that the tonic is a placebo, and that Silver Shill is an actor and accomplice of the brothers. Flim and Flam get her to keep it quiet in order to spare Granny's newfound happiness and use her reluctant approval to increase the tonic's popularity. After Granny and Apple Bloom compete in a swim meet, Applejack saves Granny from performing a dangerous high dive stunt. Realizing the harm her lies are causing, Applejack exposes the brothers' scheme and runs them out of town. Silver Shill is touched by Applejack's honesty and gives her the single coin he earned while working for the brothers and promises to change his ways.", "subseason_ep_number": "20", "absolute_ep_number": "85", "title": "Leap of Faith", "writer": "Josh Haber", "release_date": "2014-03-29"}, {"synopsis": "Twilight worries that Rainbow Dash is unprepared for a test on the history of the Wonderbolts as part of her entrance exam to join the Wonderbolts Reserves. She tries to tutor Rainbow Dash using standard academic methods, but Rainbow Dash proves too bored and restless to pay any attention. Their friends offer to help Rainbow Dash study through other unique means, only for Rainbow Dash to become overwhelmed by their clashing methods and arguing on whose method is best. While flying with her to try to cheer her up, Twilight discovers that Rainbow Dash is able to subconsciously memorize anything going on around her while she is airborne. Under Twilight's direction, everypony in Ponyville re-enacts the Wonderbolts' history as Rainbow Dash obliviously flies over the town, allowing her to retain everything and ace the exam.", "subseason_ep_number": "21", "absolute_ep_number": "86", "title": "Testing Testing 1, 2, 3", "writer": "Amy Keating Rogers", "release_date": "2014-04-05"}, {"synopsis": "Twilight and her friends attend the Rainbow Falls Traders Exchange, splitting off into pairs. Fluttershy helps Rainbow Dash acquire a rare Daring Do book through a lengthy series of trades, culminating with an exchange with an orthros for the book, but requiring Fluttershy to help housetrain the creature for an extended period. Regretting her eagerness in the trade, Rainbow Dash nullifies the exchange and trades the orthros for a bird whistle, which she gives to Fluttershy. Meanwhile, Rarity and Applejack pool their goods to trade, but begin fighting over specific items they each want that would require trading away their entire stash. They eventually get each other more affordable items similar to what they want. Finally, Pinkie Pie tries to help Twilight trade off old books by making them out to be more valuable than they are, when Twilight decides to keep the books for their treasured memories. At the end of the day, the girls happily recount their tales on their way back home.", "subseason_ep_number": "22", "absolute_ep_number": "87", "title": "Trade Ya!", "writer": "Scott Sonneborn", "release_date": "2014-04-19"}, {"synopsis": "Rarity believes her creativity is lost when a puppet stage she designed is rejected by her customer. Spike, concerned for Rarity, finds an old book in Princess Celestia and Princess Luna's old castle containing a spell that allows her to create anything she imagines on a whim. Rarity is slowly taken over by the book's magic and begins making troublesome glamorizations around Ponyville to suit her creative visions. Spike reluctantly supports Rarity, fearing he will lose her favor if he tries to stop her. Eventually, however, he takes the book away from her in the hopes of keeping her from using the spell, but she remains possessed by the book's dark magic. Finally, Spike musters the courage to tell Rarity what he truly feels about her behavior, which returns her to normal.", "subseason_ep_number": "23", "absolute_ep_number": "88", "title": "Inspiration Manifestation", "writer": "Corey Powell & Meghan McCarthy", "release_date": "2014-04-26"}, {"synopsis": "As Ponyville arrives at the Crystal Empire to compete in the Equestria Games, Spike is chosen to be the torch lighter in recognition of his role in saving the city. At the opening ceremony, Spike succumbs to performance anxiety and is unable to ignite his fire breath. To save him from embarrassment, Twilight discreetly uses her magic to light the torch for him. When Twilight tells him the truth, he tries to find other ways to help in the ceremonies, but his failures make him feel even more humiliated. During an ice archery event, one arrow goes off its mark and into a cloud, creating a giant mass of ice that threatens to crush a section of the stadium. Spike jumps in and melts the ice in time with his fire breath. Spike is hailed as a hero again and is allowed to perform the games' closing ceremony, restoring his self-confidence.", "subseason_ep_number": "24", "absolute_ep_number": "89", "title": "Equestria Games", "writer": "Dave Polsky", "release_date": "2014-05-03"}, {"synopsis": "After greeting some delegates in the Crystal Empire, Twilight laments her unfulfilling duties as a princess, but Celestia, Luna, and Cadance assure her that she will have a duty to serve. News arrives that Lord Tirek, a powerful centaur and one of Equestria's ancient enemies, has escaped from Tartarus and is draining magic from ponies to grow stronger. Twilight is eager to help, but Celestia sends Discord to capture Tirek, due to his ability to sense a magical imbalance. Discord convinces Twilight and her friends to try opening the chest from the Tree of Harmony, which he believes contains a way to defeat Tirek. While reading their friendship journal, Twilight discovers that her friends have each been challenged over their respective Elements of Harmony and rewarded with a gift from someone they inspired. The gifts become five of the six keys needed to open the chest, but Twilight has yet to have a challenge herself. Meanwhile, Tirek convinces Discord to join forces with him and they plunder more of Equestria's magic.", "subseason_ep_number": "25", "absolute_ep_number": "90", "title": "Twilight's Kingdom - Part 1", "writer": "Meghan McCarthy", "release_date": "2014-05-10"}, {"synopsis": "As Tirek continues to drain ponies' magic, the princesses give Twilight their own magic in order to hide it from Tirek, who is unaware of Twilight's existence. Tirek captures the other princesses and, learning of Twilight, turns towards Ponyville. There, he drains the magic from Twilight's friends and betrays Discord by stealing his magic as well. Twilight faces off against Tirek in a destructive battle that ends in a draw. Tirek offers Twilight her friends' freedom in exchange for her magic, to which she agrees by ordering Discord's release as well. Remorsefully, Discord gives her a medallion he had received from Tirek in their alliance, which becomes the final key needed for the chest. Twilight and her friends open the chest, and it bestows them with a new power that allows them to reimprison Tirek, free the princesses and restore everypony's magic. The chest then transforms into a new castle for Twilight to reign alongside her friends as the Princess of Friendship.", "subseason_ep_number": "26", "absolute_ep_number": "91", "title": "Twilight's Kingdom - Part 2", "writer": "Meghan McCarthy", "release_date": "2014-05-10"}], [{"synopsis": "As Twilight settles in her new castle, she and her friends sit on their respective thrones and unwittingly create a magical map showing all of Equestria, with their cutie marks pointing to a remote location on it. Deciding to investigate, they find a village where all the ponies have the same cutie mark, an equal sign. The group suspect something is wrong with the townsfolk, particularly after meeting their leader, Starlight Glimmer, who shows that everypony living there have given up their cutie marks and special talents so they can achieve true friendship by being the same. Twilight and her friends secretly meet with ponies who desire their cutie marks again, and Starlight takes them to a vault where the cutie marks are kept. Upon arrival, the group are lured into a trap and Starlight takes their cutie marks.", "subseason_ep_number": "01", "absolute_ep_number": "92", "title": "The Cutie Map - Part 1", "writer": "Scott Sonneborn & M. A. Larson; story by Meghan McCarthy", "release_date": "2015-04-04"}, {"synopsis": "Without their cutie marks, Twilight and her friends are trapped in the village while Starlight waits for them to accept their fate. They send Fluttershy, who has been the most open to the townsfolk, to act as though she has accepted Starlight's ways in order to help the others escape. That night, Fluttershy sneaks out and discovers that Starlight never gave up her cutie mark and is using make-up to mask her real one. When Starlight frees the others the next day, Fluttershy exposes her ruse to the townsfolk by splashing water on her. As Starlight flees with the girls' cutie marks, the townsfolk reclaim their own cutie marks and chase Starlight down, successfully recovering the six marks. Starlight manages to escape, while everypony returns to the village to celebrate getting their individuality back.", "subseason_ep_number": "02", "absolute_ep_number": "93", "title": "The Cutie Map - Part 2", "writer": "Scott Sonneborn & M. A. Larson; story by Meghan McCarthy", "release_date": "2015-04-04"}, {"synopsis": "As Twilight spends hours helping her friends, they learn that she has been avoiding her castle because she does not feel at home there. They offer to decorate the castle, arranging Spike to take Twilight for a day around Ponyville. In their first attempt, they end up cluttering the castle with their own clashing styles. They try to remove pieces one by one, but only end up satisfied when everything is emptied out, making no progress. Realizing that they all miss Twilight's old home at the destroyed Golden Oak Library, they fashion the tree's roots into a chandelier adorned with gems to remind Twilight of her old memories from Ponyville and inspire her to make new ones. Twilight returns to the castle and is moved by her friends' gift, finding that they have each decorated a different room in the castle themselves.", "subseason_ep_number": "03", "absolute_ep_number": "94", "title": "Castle Sweet Castle", "writer": "Joanna Lewis & Kristine Songco", "release_date": "2015-04-11"}, {"synopsis": "After learning that Babs Seed has earned her cutie mark and is no longer a Cutie Mark Crusader, Apple Bloom begins to worry about getting her own cutie mark. That night, she has a series of nightmares in which her cutie mark appears only for her to either dislike her talent or become cast out by her friends and family. In each dream, a shadowy figure helps remove her cutie mark which only makes the dreams worse. Princess Luna then appears in the dream and shows Apple Bloom that Sweetie Belle and Scootaloo have been having similar dreams about their cutie marks, teaching the Crusaders not to fear who they are or what others think of them. The Crusaders affirm that they will always remain friends by deciding to help Babs face her own anxieties about her cutie mark.", "subseason_ep_number": "04", "absolute_ep_number": "95", "title": "Bloom & Gloom", "writer": "Josh Haber", "release_date": "2015-04-18"}, {"synopsis": "Rainbow Dash is excited to spend her first winter with her pet tortoise Tank until she learns from Fluttershy that he has to hibernate for the winter. Refusing to let Tank hibernate, Rainbow Dash tries to stop winter from coming, but cannot hold back the efforts of the hard-working weather ponies. She then gets an idea to sabotage the weather factory in Cloudsdale, but accidentally creates a blizzard that speeds up winter instead. After her friends help her cope with saying goodbye to Tank, Rainbow Dash finally agrees to let him hibernate.", "subseason_ep_number": "05", "absolute_ep_number": "96", "title": "Tanks for the Memories", "writer": "Cindy Morrow", "release_date": "2015-04-25"}, {"synopsis": "While arriving in Appleoosa for a rodeo, Applejack forbids the Cutie Mark Crusaders from participating after a local outlaw named Trouble Shoes is spotted ruining an upcoming show. Despite this, the Crusaders run off on their own to bring Trouble Shoes to justice in the hopes of earning their cutie marks in the rodeo. When they find Trouble Shoes, they learn that he is actually a kind-hearted yet clumsy pony who causes trouble by accident to which he blames his bad luck on his cutie mark. He agrees to lead the Crusaders back to town, but he is caught and arrested by Sheriff Silverstar and his posse who accuse Trouble Shoes of kidnapping the Crusaders. The Crusaders then break Trouble Shoes out of prison and disguise him as a rodeo clown so he can enter the rodeo like he always wanted, convincing him to view his cutie mark more positively. Trouble Shoes is exposed during his performance, but since the other ponies are entertained by his clumsy routine, they all forgive him and allow him to permanently perform for them after the Crusaders admit they ran away.", "subseason_ep_number": "06", "absolute_ep_number": "97", "title": "Appleoosa's Most Wanted", "writer": "Dave Polsky", "release_date": "2015-05-02"}, {"synopsis": "As the Grand Galloping Gala nears, Discord is disappointed that Fluttershy already invited another friend named Tree Hugger instead of him. Refusing to show his jealousy, Discord creates his own plans to go to the Gala by bringing a slimy creature called the Smooze as his guest. During the Gala, Discord attempts to get Fluttershy to talk to him over Tree Hugger but finds attending to the Smooze to be distracting and stuffs it away in a closet filled with gems and gold. The Smooze digests the treasures and grows to immense size, flooding the Gala, until Tree Hugger lulls it back to a harmless state with soothing music. Finally snapping, Discord threatens to send Tree Hugger into a different dimension, but Fluttershy reprimands him for his behavior. Afterwards, Discord apologizes to both Fluttershy and Tree Hugger, reverts the Smooze to normal and they all enjoy the rest of the Gala together.", "subseason_ep_number": "07", "absolute_ep_number": "98", "title": "Make New Friends but Keep Discord", "writer": "Natasha Levinger", "release_date": "2015-05-16"}, {"synopsis": "When the map sends Rainbow Dash and Pinkie Pie to solve a friendship problem in the griffon kingdom of Griffonstone, they find the once thriving city is run down ever since the golden Idol of Boreas, the city's symbol of power, was stolen by a monster and fell into a chasm. They also run into Rainbow Dash's former friend Gilda, who is still resentful from her past visit to Ponyville. Rainbow Dash goes to recover the lost idol, believing it will restore Griffonstone's former glory, while Pinkie remains to help the griffons rediscover friendship, starting by helping Gilda improve her scone recipe. When Rainbow Dash gets stuck in the chasm, Pinkie convinces Gilda to help rescue her. Gilda spots the idol teetering on a nearby ledge, but she chooses to save Rainbow Dash instead, and the idol falls into the chasm. Gilda and Rainbow Dash make up, and Gilda is able to use Pinkie's friendship idea to help more griffons become more friendly than before.", "subseason_ep_number": "08", "absolute_ep_number": "99", "title": "The Lost Treasure of Griffonstone", "writer": "Amy Keating Rogers", "release_date": "2015-05-23"}, {"synopsis": "Cranky and Matilda are scheduled to be married but realize the invitations that were sent out across Equestria have it set for that day due to Derpy's printing error. They race to reschedule the event for the day, while Twilight and her friends fight off a bugbear attacking Ponyville. During this, the episode highlights various other residents of Ponyville as they prepare for the wedding, such as Dr. Hooves, Derpy, DJ Pon-3, Octavia Melody, Lyra Heartstrings, Bon Bon and Steven Magnet. Eventually, despite the tribulations, the wedding goes off on time and the bugbear is defeated with Mayor Mare, officiating the wedding, commenting on how Ponyville is filled with many varied and interesting characters with their own stories.", "subseason_ep_number": "09", "absolute_ep_number": "100", "title": "Slice of Life", "writer": "M. A. Larson", "release_date": "2015-06-13"}, {"synopsis": "Twilight becomes exhausted and falls asleep after hosting a large delegation in Canterlot, and Princess Cadance asks Spike to make sure no one disturbs Twilight. When the delegates begin making complaints to Twilight, Spike makes his own decisions on Twilight's behalf instead of waking her. He soon becomes power hungry and tries to complete Twilight's other tasks in her place. However, his poor decisions quickly lead to a chain of disasters across Canterlot, causing the angered delegates to go and confront Twilight. Spike manages to keep them out of her room, but Twilight awakens refreshed and discovers the problems he has caused. Spike apologizes to the delegates, and they help him fix a ceremonial statue made from gemstones as a sign of forgiveness.", "subseason_ep_number": "10", "absolute_ep_number": "101", "title": "Princess Spike", "writer": "Neal Dusedau; story by Jayson Thiessen & Jim Miller", "release_date": "2015-06-20"}, {"synopsis": "A friendship summit with visiting yaks turns into a disaster when the ponies fail to replicate the yaks' traditions, angering them into declaring war. Feeling pressured by her inability to appease the yaks, Pinkie Pie decides she must bring something from their native land of Yakyakistan to make them feel at home. She embarks on a journey across Equestria and receives help from various ponies, but when she reaches Yakyakistan's gates, she accidentally slides all the way back home on a sled. Pinkie despairs over her wasted effort, but she is inspired by her friends' appreciation of her hard work to share the ponies' own tradition of friendship with the yaks, who are touched and make peace with the ponies.", "subseason_ep_number": "11", "absolute_ep_number": "102", "title": "Party Pooped", "writer": "Nick Confalone; story by Jayson Thiessen & Jim Miller", "release_date": "2015-06-27"}, {"synopsis": "Twilight becomes distraught after Spike innocently reminds her of the neglectful friend she used to be before moving to Ponyville, so she returns to Canterlot to rekindle her old friendships. Although most of her friends are happy to reconnect with her, Twilight learns that her antisocial friend Moon Dancer has become a total recluse ever since Twilight skipped her first party the day before her move. When Moon Dancer rebuffs all of Twilight's efforts to help her reembrace friendship, Twilight enlists Pinkie Pie to throw another party as an apology. The gesture instead enrages Moon Dancer, who expresses her heartbreak over being dismissed by her friend. Realizing Twilight has invited others who already care for her, Moon Dancer is convinced to forgive Twilight and finally accept her friendship.", "subseason_ep_number": "12", "absolute_ep_number": "103", "title": "Amending Fences", "writer": "M. A. Larson", "release_date": "2015-07-04"}, {"synopsis": "Princess Luna's dreams are inhabited by the Tantabus, a parasitic smoke monster that turns her dreams into nightmares. During a dream where Luna, as Nightmare Moon, battles Twilight and her friends, the Tantabus escapes into the six ponies' dreams. Luna enters each pony's dream to catch the Tantabus before it can grow powerful enough to spread its influence into the waking world. Unfortunately, it infects all of Ponyville when Pinkie Pie dreams of sharing ice cream with the whole town, requiring Luna to merge every pony's dreams into one. Despite the townsfolk's efforts to help contain the Tantabus, it grows in size when Luna blames herself for creating it as self-punishment for her actions as Nightmare Moon. Realizing her guilt is what empowers the Tantabus, Luna is able to stop it by forgiving herself. With the Tantabus gone, Luna is finally able to sleep peacefully.", "subseason_ep_number": "13", "absolute_ep_number": "104", "title": "Do Princesses Dream of Magic Sheep?", "writer": "Scott Sonneborn; story by Jayson Thiessen & Jim Miller", "release_date": "2015-07-11"}, {"synopsis": "Rarity achieves her dream of opening her own boutique in Canterlot. She makes a variety of dresses, but her business-savvy manager Sassy Saddles focuses on marketing one particular dress, which becomes extremely popular. Sassy tasks Rarity with mass-producing the dress under strict regulations, which causes Rarity to lose her passion for dressmaking. Feeling miserable despite her success, Rarity decides to close the boutique with a going-out-of-business sale of all her unsold designs, which prove to be just as successful as her original dress. This reinvigorates Rarity and convinces her to keep the store open under Sassy's management, who is inspired to follow Rarity's example in dressmaking.", "subseason_ep_number": "14", "absolute_ep_number": "105", "title": "Canterlot Boutique", "writer": "Amy Keating Rogers", "release_date": "2015-09-12"}, {"synopsis": "During a Wonderbolts aerial display in Canterlot, Rainbow Dash is accused of sending Spitfire away on a fake errand to replace her and fly alongside her idol Wind Rider. Seeing this, Rarity investigates the crime to prove her friend's innocence, but her constant habit of acting out a film noir mystery makes Rainbow Dash doubt her. Eventually, Rarity is successfully able to identify the true culprit as Wind Rider, who confesses to framing Rainbow Dash in order to protect his flight speed record. Spitfire then discharges Wind Rider from the Wonderbolts as punishment to which Rainbow Dash is allowed to take his place in the display.", "subseason_ep_number": "15", "absolute_ep_number": "106", "title": "Rarity Investigates!", "writer": "Joanna Lewis & Kristine Songco; story by Meghan McCarthy, M. A. Larson, Joanna Lewis & Kristine Songco", "release_date": "2015-09-19"}, {"synopsis": "When the map sends Applejack and Rarity to solve a friendship problem in Manehattan, they find their friend Coco Pommel trying to revive her neighborhood's community theater. Unable to find any volunteers to assist, they offer to help Coco by themselves. Applejack takes up the task of repairing the run-down theater at the local park, but she fails to finish before her scheduled time. She instead builds a small stage outside the park, where they attract anypony passing by with a play depicting the original theater's creation. The play is a success and inspires the citizens of Manehattan to do more for their community.", "subseason_ep_number": "16", "absolute_ep_number": "107", "title": "Made in Manehattan", "writer": "Noelle Benvenuti", "release_date": "2015-09-26"}, {"synopsis": "Occurring in the same storyline as \"Made in Manehattan\", Apple Bloom is disappointed that Applejack cannot participate in the Sisterhooves Social competition with her since she left for Manehattan. Seeing this, Big Mac then decides to enter the competition in Applejack's place by disguising himself as Apple Bloom's fake female cousin Orchard Blossom, much to her embarrassment. During the competition, Big Mac accidentally wreaks havoc in his eagerness to win Apple Bloom a blue ribbon eventually resulting in them getting disqualified. They later reconcile after Big Mac admits that he misses being idolized by Apple Bloom as much as Applejack.", "subseason_ep_number": "17", "absolute_ep_number": "108", "title": "Brotherhooves Social", "writer": "Dave Polsky", "release_date": "2015-10-03"}, {"synopsis": "The Cutie Mark Crusaders help their classmate Pipsqueak win their class's student president election against Diamond Tiara, who is berated by her mother Spoiled Rich for failing to live up to their family's social image. Feeling sorry for Diamond Tiara, the Crusaders offer to help her change her ways so she can earn her classmates' support. When they learn Pipsqueak is unable to fulfill any of his promises as student president, Diamond Tiara attempts to replace him to regain her mother's favor. With the Crusaders' persuasion, however, Diamond Tiara stands up to her mother and lends her family's funds to the school instead. Upon dedicating themselves to helping others understand their talents, the Crusaders simultaneously earn their cutie marks and celebrate with their friends and family.", "subseason_ep_number": "18", "absolute_ep_number": "109", "title": "Crusaders of the Lost Mark", "writer": "Amy Keating Rogers", "release_date": "2015-10-10"}, {"synopsis": "Shining Armor and Princess Cadance are arriving in Ponyville in a few days, and Pinkie Pie learns from the Cakes that they are going to surprise Twilight and the others with news that they are having a baby. Pinkie promises to keep the news a secret but becomes stressed over maintaining it as she helps with the visit's preparations. When they finally arrive, Shining Armor sets up a scavenger hunt for Twilight and the others to receive a surprise award and Pinkie, barely able to contain the secret, aggressively answers the riddles until they meet Shining Armor and Cadance at Sugarcube Corner. They reveal the surprise, delighting Twilight and relieving Pinkie of her burden.", "subseason_ep_number": "19", "absolute_ep_number": "110", "title": "The One Where Pinkie Pie Knows", "writer": "Gillian M. Berrow", "release_date": "2015-10-17"}, {"synopsis": "Pinkie Pie invites Applejack and her family to spend Hearth's Warming together at the Pie rock farm. The Apples quickly discover that the Pies have very different traditions around the holiday and are much less joyful than what they are used to. Applejack tries to liven the mood by introducing her family's traditions to the Pies, but in her haste, she causes Holder's Boulder, a giant rock the Pies hold dear, to fall into a quarry. Ashamed, Applejack and her family decide to leave. On the train ride back, Granny Smith informs Applejack that Holder's Boulder is a centerpiece of the farm and part of their traditions. Applejack returns to the farm with her family to apologize to the Pies for forcing her traditions onto them and helps them push Holder's Boulder back to its proper place. The two families reconcile their differences and continue to enjoy the holiday.", "subseason_ep_number": "20", "absolute_ep_number": "111", "title": "Hearthbreakers", "writer": "Nick Confalone", "release_date": "2015-10-24"}, {"synopsis": "Fluttershy is forced to go out on Nightmare Night to buy food for Angel instead of shutting herself in her cottage as usual. She decides to use this as an opportunity to join her friends in the festivities, putting together a horror attraction to avoid letting her overly fearful nature ruin the fun for them. Her first attempt falls short of their expectations, but with the help of her animal friends, she adds a terrifying section to the Apple family corn maze to surprise her friends. Fluttershy's plan succeeds too well, causing her friends to believe they are actually in danger. Although the others are impressed when they realize the truth, Fluttershy realizes she is uncomfortable with scaring others and decides to stop forcing herself to do what she dislikes.", "subseason_ep_number": "21", "absolute_ep_number": "112", "title": "Scare Master", "writer": "Natasha Levinger", "release_date": "2015-10-31"}, {"synopsis": "Twilight returns from a three-day break of reorganizing her library alone with Spike, only to find that her friends have spent a memorable and hilarious bonding activity with Discord. Refusing to admit her jealousy at being left out, Twilight focuses on understanding how her friends could become so close to Discord by trying to recreate their weekend as an \"experiment\". When this fails, Twilight convinces herself that Discord has put her friends under a spell, but the potion she forces them to drink in order to prove it has no effect. Finally snapping, Twilight admits to her friends that as the Princess of Friendship, she believes she has no right to feel jealous. Her friends then apologize to her for making her feel left out and playfully ignore Discord after he reveals he intentionally convinced them to leave her out in order to teach her this lesson.", "subseason_ep_number": "22", "absolute_ep_number": "113", "title": "What About Discord?", "writer": "Neal Dusedau", "release_date": "2015-11-07"}, {"synopsis": "When the map sends Twilight and Fluttershy to solve a friendship problem in a valley within the Smokey Mountains, they meet two neighboring families, known as the Hooffields and the McColts, who both have a long-standing feud. With the valley in shambles from the feud, Twilight believes this is a simple friendship problem and tries to get both sides to discuss the matter. However, the feud has gone on for so long, neither side remembers how it started and their misunderstandings of Twilight's plan only makes the fighting worse. Fluttershy learns that the animals in the area have no food or shelter due to the feud, which started over a petty argument between the two families' ancestors over a nature preserve. Realizing their fighting is pointless, the two families make peace and help to restore the valley's wildlife together.", "subseason_ep_number": "23", "absolute_ep_number": "114", "title": "The Hooffields and McColts", "writer": "Joanna Lewis & Kristine Songco", "release_date": "2015-11-14"}, {"synopsis": "While Applejack organizes a music festival at Sweet Apple Acres, Pinkie Pie tells everypony that she booked Countess Coloratura, Equestria's most famous pop singer, to perform at the festival. Applejack believes Countess Coloratura is her childhood friend who she nicknamed \"Rara\", but when Coloratura arrives, Applejack is confused to see that she appears to be an overly demanding diva, unlike the humble pony she knew. Applejack discovers that Coloratura is still the same, charitable pony as always and that her demands come from her manager Svengallop, who uses her fame for his benefit. After Applejack and her friends expose Svengallop's greed to Coloratura, he leaves her to manage the performance on her own. Encouraged by Applejack, Coloratura sings a passionate ballad where she embraces her true self, amazing her fans.", "subseason_ep_number": "24", "absolute_ep_number": "115", "title": "The Mane Attraction", "writer": "Amy Keating Rogers", "release_date": "2015-11-21"}, {"synopsis": "After giving a lecture about cutie marks at the School for Gifted Unicorns, Twilight and Spike return home and encounter Starlight Glimmer, who has returned to exact revenge against Twilight for ruining her utopian society. Using Star Swirl the Bearded's time travel spell, Starlight travels back in time to the point Rainbow Dash performed her first Sonic Rainboom, which allowed Twilight and her friends to obtain their cutie marks at the same time. Twilight and Spike follow after her but fail to stop her from sabotaging the race. They return to an alternate present where Equestria is at war with King Sombra, but the map remains and grants them access to reuse Star Swirl's spell to take them back to the past and stop Starlight. Their second attempt lands them in another alternate present ruled by Queen Chrysalis.", "subseason_ep_number": "25", "absolute_ep_number": "116", "title": "The Cutie Re-Mark - Part 1", "writer": "Josh Haber", "release_date": "2015-11-28"}, {"synopsis": "Twilight and Spike are now trapped in a time loop as they repeatedly fail to stop Starlight from altering the past, which creates numerous alternate versions of Equestria dominated by its enemies. Knowing they cannot stop her, they forcibly take Starlight with them to a wasteland to show how her actions are ravaging Equestria. Starlight refuses to believe them and shows them her own childhood, revealing that she lost touch with her friend Sunburst after he earned his cutie mark and left to study magic in Canterlot, which lead her to believe that cutie marks ruin friendships. As she attempts to stop the Rainboom again to prove her point, Twilight convinces her to give friendship another chance and they return to the unaltered present together. After deliberating with her friends, Twilight decides to take Starlight on as her student and her friends accept her as a friend as well.", "subseason_ep_number": "26", "absolute_ep_number": "117", "title": "The Cutie Re-Mark - Part 2", "writer": "Josh Haber", "release_date": "2015-11-28"}], [{"synopsis": "While teaching her new student, Starlight Glimmer, the ways of friendship, Twilight and her friends are invited to the Crystal Empire to attend the Crystalling, a magical ceremony honoring the birth of Shining Armor and Princess Cadance's newborn baby. Twilight also brings Starlight along to reconnect with her estranged childhood friend Sunburst as her first friendship lesson. Starlight is anxious to keep Sunburst from learning of her past villainy and tries to avoid the reunion. They eventually meet, and following an awkward conversation with him, Starlight assumes Sunburst to be a successful wizard who has moved on from their friendship. Meanwhile, Twilight and her friends are shocked to discover that the baby is an alicorn with powerful, uncontrollable magic. After the ponies finish the preparations for the ceremony, the baby makes a booming wail that causes the Crystal Heart to shatter into pieces, allowing a deadly snowstorm to descend upon the city.", "subseason_ep_number": "01", "absolute_ep_number": "118", "title": "The Crystalling - Part 1", "writer": "Josh Haber", "release_date": "2016-03-26"}, {"synopsis": "The ponies desperately search for a spell to restore the Crystal Heart and save the Crystal Empire from the snowstorm. Starlight believes Sunburst can help, but when she goes to retrieve him, he despairingly admits he is not a powerful wizard as she believes. Starlight reveals her own past mistakes to him and they reconcile. Using the knowledge he gained from his schooling, Sunburst determines that the baby's Crystalling will repair the heart, stave off the storm and bring her magic under control. Shining Armor and Cadance choose Sunburst as the baby's crystaller so he can help Starlight and the princesses with the Crystalling, and by the end of the ordeal, name their daughter Flurry Heart to mark the occasion.", "subseason_ep_number": "02", "absolute_ep_number": "119", "title": "The Crystalling - Part 2", "writer": "Josh Haber", "release_date": "2016-03-26"}, {"synopsis": "Pinkie Pie joins Rarity on a business trip to Manehattan for an annual sightseeing tour and gift exchange with her sister Maud. As Rarity keeps Maud distracted, Pinkie tries to buy a fancy pouch for Maud's pet rock Boulder, hoping to be able to give a gift as good as the ones Maud always gets for her. The pouch store is closed, but Rarity spots a stallion with the very pouch that Pinkie wants and he trades it for Pinkie's party cannon. After Maud gives Pinkie her gift, confetti for the cannon, she learns what Pinkie has done and returns the pouch for the cannon, telling Pinkie not to treat their gift exchange like a competition.", "subseason_ep_number": "03", "absolute_ep_number": "120", "title": "The Gift of the Maud Pie", "writer": "Michael P. Fox & Wil Fox; story by Josh Haber, Michael P. Fox & Wil Fox", "release_date": "2016-04-02"}, {"synopsis": "After finally earning their cutie marks and understanding their purpose in life, the Cutie Mark Crusaders set out to help other ponies who lack or are discontent with their own cutie marks. They are unable to find many cutie mark problems, however, so they split up to pursue their own interests in the meantime. Feeling alone and indecisive, Apple Bloom takes up ballet and encounters Tender Taps, a blank flank colt who suffers from performance anxiety despite his talent for tap dancing. The Crusaders help Tender Taps overcome his fear and earn his cutie mark, realizing they can use their experiences apart to help others.", "subseason_ep_number": "04", "absolute_ep_number": "121", "title": "On Your Marks", "writer": "Dave Polsky & Josh Haber; story by Dave Polsky", "release_date": "2016-04-09"}, {"synopsis": "While collecting gems with Rarity, Spike starts glowing, meaning that he is being summoned to the Dragons Lands. When Spike arrives with Twilight and Rarity, he finds that he and every other dragon in Equestria have been summoned to participate in the Gauntlet of Fire, a perilous challenge designed to dub the new Dragon Lord. Spike initially has no interest in competing, but changes his mind upon realizing the other competitors, including Garble, who holds a grudge against Spike and his friends, are eager to use the position to pillage Equestria. Receiving support from Twilight and Rarity, Spike saves the life of Princess Ember, the daughter of the current Dragon Lord Torch, who has secretly entered the gauntlet to prove herself a worthy leader. Initially reluctant, Ember teams up with Spike and helps him claim the bloodstone scepter that determines the winner, forcing Garble to stand down when he attacks his friends. Spike then passes the scepter onto Ember, declaring her the true Dragon Lord.", "subseason_ep_number": "05", "absolute_ep_number": "122", "title": "Gauntlet of Fire", "writer": "Joanna Lewis & Kristine Songco", "release_date": "2016-04-16"}, {"synopsis": "Twilight instructs Starlight to make a new friend in Ponyville to invite to a dinner party with Princess Celestia. After her other efforts come up short, Starlight meets Twilight's former adversary Trixie and relates with her over their mutual search for forgiveness for their past villainy. Twilight disapproves of their friendship, doubting Trixie's intentions despite previously forgiving her. Appalled by Twilight's lack of trust, Starlight chooses to skip the dinner to act as Trixie's assistant for a magic stunt. When Twilight confronts them before the show, Trixie thoughtlessly brags that she has been using her friendship with Starlight in an act of revenge against Twilight, which devastates Starlight. Noticing Trixie's heartbreak over deceiving her friend, Twilight convinces Starlight to give Trixie another chance. Starlight helps Trixie complete her stunt just in time, and the three ponies make amends.", "subseason_ep_number": "06", "absolute_ep_number": "123", "title": "No Second Prances", "writer": "Nick Confalone", "release_date": "2016-04-30"}, {"synopsis": "Rainbow Dash finally joins the Wonderbolts after one of its members retires. During her first day of flight practice, she makes a rookie mistake and crashes into a trash can, leading her teammates to calling her \"Rainbow Crash\", a nickname previously used by bullies. Hurt by this nickname, Rainbow Dash tries to find other ways to change the others' impression of her by mimicking her friends, without success. When the Wonderbolts perform a show in Ponyville, Rainbow Dash enlists Scootaloo's help to perform an unscheduled stunt to impress them, but it backfires and results in her suffering an even more disastrous crash. After the show, the Wonderbolts explain to Rainbow Dash that they all have humiliating nicknames, and that they already regard her highly for her past accomplishments. They keep her on the team, though Spitfire puts her on a month-long probation for her actions.", "subseason_ep_number": "07", "absolute_ep_number": "124", "title": "Newbie Dash", "writer": "Dave Rapp; story by Dave Polsky & Dave Rapp", "release_date": "2016-05-07"}, {"synopsis": "On Hearth's Warming Eve, Starlight does not feel like celebrating, so Twilight decides to read her favorite holiday story, A Hearth's Warming Tale, to help her appreciate the holiday better. In the story, Snowfall Frost, a cold-hearted unicorn who despises Hearth's Warming, prepares a spell to erase the holiday from existence. Her actions draw the attention of three spirits, who intend to dissuade her from casting the spell by showing her visions of various Hearth's Warming scenes. First, the Spirit of Hearth's Warming Past reminds Snowfall of the holiday spirit she abandoned in her youth to focus on her studies. Next, the Spirit of Hearth's Warming Presents helps Snowfall understand the spirit of friendship that the holiday represents. Finally, the Spirit of Hearth's Warming Yet to Come reveals that Snowfall's spell would leave Equestria defenseless against the Windigos' eternal winter, which convinces Snowfall to change her ways. After the story ends, Starlight similarly realizes the importance of Hearth's Warming and joins her friends in the festivities.", "subseason_ep_number": "08", "absolute_ep_number": "125", "title": "A Hearth's Warming Tail", "writer": "Michael Vogel", "release_date": "2016-05-14"}, {"synopsis": "Rarity and her friends are interviewed for a newspaper review of Rarity's new boutique in Manehattan. While Rarity believes the store's grand opening was a perfect success, her friends openly recount their numerous blunders and last-minute solutions that they hid from Rarity during the preparations. With their mistakes exposed in the review, they fear Rarity will be disappointed in them for almost ruining the opening. To their surprise, the review ends with a glowing assessment of Rarity and her friends' individual contributions that have helped ensure the store's success.", "subseason_ep_number": "09", "absolute_ep_number": "126", "title": "The Saddle Row Review", "writer": "Nick Confalone", "release_date": "2016-05-21"}, {"synopsis": "Rarity wishes to spend time with Applejack at the spa, but Applejack is too busy to make good on her promises. Twilight and Spike agree to do Applejack's chores by her exact instructions, freeing up an hour for Applejack to spend with Rarity. To Rarity's annoyance, Applejack spends most of this time fixing the spa's plumbing, which has been accidentally causing larger problems around the spa. Applejack returns to the farm to find that Twilight and Spike have not yet completed their task due to too many unnecessary steps in Applejack's instructions. Twilight, Spike and Rarity help Applejack streamline her workload, finally allowing her to take the rest of the day off.", "subseason_ep_number": "10", "absolute_ep_number": "127", "title": "Applejack's \"Day\" Off", "writer": "Michael P. Fox & Wil Fox; story by Neal Dusedau, Michael P. Fox & Wil Fox", "release_date": "2016-05-28"}, {"synopsis": "Fluttershy's younger brother Zephyr Breeze moves into their parents' house after his attempt to become a mane therapist goes wrong. Fluttershy convinces Zephyr to move out, only for him to move into her cottage. She tries to help him find a job, but he manages to find ways to avoid doing any work, so she kicks him out. Later feeling sorry for Zephyr when he takes up living in the woods, Fluttershy understands that he feels unable to do anything because of his fear of failure. Encouraged by Fluttershy to keep trying despite his frustrations, Zephyr commits to becoming a mane stylist and eventually graduates from his class.", "subseason_ep_number": "11", "absolute_ep_number": "128", "title": "Flutter Brutter", "writer": "Dave Rapp; story by Meghan McCarthy", "release_date": "2016-06-04"}, {"synopsis": "After Twilight and Starlight reactivate the map, which has been inactive ever since they used it to travel back in time, it sends Pinkie Pie and Rarity to solve a friendship problem in Canterlot. When they arrive, they find the Tasty Treat, a struggling Indian-style restaurant where the owner, Coriander Cumin, and his chef daughter, Saffron Masala, are too busy arguing with each other to help their business. Pinkie and Rarity decide to help give the restaurant a positive review from well-known food critic Zesty Gourmand, but because of their conflicting views; Rarity encouraging Coriander to conform to Zesty's specific standards, and Pinkie encouraging Saffron to be unique, their efforts fail to impress Zesty. Undeterred, they manage to reconcile their differences to bring an audience of ponies to the restaurant in defiance of Zesty's dictatorial opinions about food, renewing Coriander and Saffron's passion for cooking.", "subseason_ep_number": "12", "absolute_ep_number": "129", "title": "Spice Up Your Life", "writer": "Michael Vogel", "release_date": "2016-06-11"}, {"synopsis": "Rainbow Dash attends a Daring Do convention where she meets another avid fan named Quibble Pants. They quickly become friends until Quibble criticizes the newer Daring Do books as unrealistic, which upsets Rainbow Dash, who secretly knows Daring Do is real. Daring Do approaches Rainbow Dash for help looking out for Dr. Caballeron, who is following her in her search for a priceless artifact in a jungle temple. After Rainbow Dash runs into Quibble again and makes a scene, Caballeron abducts them both and takes them into the jungle. Quibble believes their adventure to the temple is all a staged role-play until a fantastic creature nearly eats them. Daring Do arrives and saves them, finally convincing Quibble that her stories are true. He and Rainbow Dash help Daring Do find the artifact and escape the temple, after which Daring Do gets rid of Caballeron and directs them to safety. As they return to the convention, Quibble admits that he still dislikes the newer books, but has come to respect what Rainbow Dash admires about them, mending their friendship.", "subseason_ep_number": "13", "absolute_ep_number": "130", "title": "Stranger Than Fan Fiction", "writer": "Josh Haber & Michael Vogel", "release_date": "2016-07-30"}, {"synopsis": "Ponyville holds its annual Applewood Derby, a kart race where the school ponies are to drive their own self-made vehicles with the help of older ponies. The Cutie Mark Crusaders enlist Rainbow Dash, Applejack and Rarity to assist with their karts, but they get carried away in their excitement for the derby and completely ignore the different design ideas that the Crusaders want to try, and eventually take over as drivers. During the race, they crash into each other and destroy their karts in a pile-up. The Crusaders yell at them for ruining the derby, causing Rainbow Dash, Applejack and Rarity to apologize while also telling the Crusaders not to assume that their elders always know best. They help the Crusaders rebuild their karts the way they want, sitting out to let them enjoy the derby.", "subseason_ep_number": "14", "absolute_ep_number": "131", "title": "The Cart Before the Ponies", "writer": "Ed Valentine; story by Ed Valentine and Michael Vogel", "release_date": "2016-08-06"}, {"synopsis": "Rainbow Dash goes on a pranking spree around Ponyville, irritating her friends, who find her jokes unfunny and hurtful. Failing to reason with her, the townsfolk send Pinkie Pie, the only pony not offended by the pranks, to convince her to stop. Instead, Rainbow Dash divulges her plan to prank the entire town with joke cookies made to turn their mouths rainbow-colored, feeding one to Pinkie as a demonstration. Later, Pinkie falls sick with an appetite for more joke cookies while Rainbow Dash helps sell them around town. That night, Rainbow Dash checks on Pinkie to find that the cookies have turned her and everypony else in town into cookie-craving zombies. Once a terrified Rainbow Dash apologizes for her prank, the townsfolk reveal the entire outbreak to be an elaborate prank devised by Pinkie to teach her to think about other ponies' feelings first before she goes along with the pranks.", "subseason_ep_number": "15", "absolute_ep_number": "132", "title": "28 Pranks Later", "writer": "F.M. De Marco; story by Meghan McCarthy", "release_date": "2016-08-13"}, {"synopsis": "During a visit to the Crystal Empire, Twilight, Starlight and Spike find the city in a state of panic over a changeling sighting. After getting lost during the search effort, Spike is rescued by the changeling, Thorax, from falling down a chasm. Realizing Thorax only wants to make friends despite facing prejudice from ponies, Spike introduces him to the city disguised as a longtime friend named \"Crystal Hoof\". When Spike shows Flurry Heart to Throax, her love overwhelms him, causing him to drop his disguise, and Spike struggles to stand up for Thorax as his friends chase him away. Feeling guilty, Spike reunites with Thorax and defends him against the ponies, professing that Thorax is his friend and deserves another chance like anypony else. His impassioned plea touches the ponies, who welcome Thorax into their community.", "subseason_ep_number": "16", "absolute_ep_number": "133", "title": "The Times They Are A Changeling", "writer": "Kevin Burke & Chris \"Doc\" Wyatt; story by Michael Vogel, Kevin Burke & Chris \"Doc\" Wyatt", "release_date": "2016-08-20"}, {"synopsis": "Discord becomes lonely when Fluttershy embarks on a trip to Yakyakistan with her friends. Feeling sorry for Discord, Spike and Big Mac invite him to their get-together to cheer him up while the others are away. To Discord's disappointment, their evening involves playing a tabletop role-playing game called Ogres & Oubliettes and he quickly grows bored and attempts to take over the evening with his own ideas of fun. When Spike and Big Mac remain firm in playing their game, Discord angrily teleports them to a dimension where the game's monsters and danger are real. Fed up, they eject Discord from the game, leaving him dejected once more. They quickly feel guilty and allow him to stay, finding that his real-life version of their game is much more entertaining. Fluttershy and her friends return to find them enjoying a toned-down version of the game.", "subseason_ep_number": "17", "absolute_ep_number": "134", "title": "Dungeons & Discords", "writer": "Nick Confalone", "release_date": "2016-08-27"}, {"synopsis": "Applejack is challenged by her cousin Braeburn to a game of \"buckball\" in Appleloosa. While recruiting new players for Ponyville's team, she and Rainbow Dash are surprised to find that Pinkie Pie and Fluttershy are much better players than they are and lets them take their place. Snails is also recruited for his unexpected ball-catching skills. Applejack and Rainbow Dash put them through rigorous training exercises, causing Pinkie and Fluttershy to feel pressured and lose their edge. When Applejack and Rainbow Dash try encouraging them by gathering all of Ponyville to cheer them on, Pinkie and Fluttershy fear of disappointing the town and refuses to play. Applejack and Rainbow Dash realize their competitiveness has ruined the sport for Pinkie and Fluttershy, who play best when having fun. To rebuild their confidence, Applejack and Rainbow Dash convince them to help them practice. Pinkie and Fluttershy regain their love of the sport, motivating them to win the game against Appleloosa.", "subseason_ep_number": "18", "absolute_ep_number": "135", "title": "Buckball Season", "writer": "Jennifer Skelly", "release_date": "2016-09-03"}, {"synopsis": "The Cutie Mark Crusaders are approached by Gabby, a griffon who is obsessed with cutie marks and desires one for herself. Not knowing if it is possible for griffons to have cutie marks, the Crusaders try anyway by taking Gabby through a list of helpful activities to see if she gets one. Although Gabby excels at everything she attempts, no cutie mark appears, and the Crusaders despair that their task is impossible. Feeling sorry for the Crusaders, Gabby surprises them by revealing a fake cutie mark she has \"earned\", but they soon discover the truth when she suddenly tries to leave. The Crusaders determine that, despite her lack of a mark, Gabby still has a purpose in life by helping others, and they made her an honorary member.", "subseason_ep_number": "19", "absolute_ep_number": "136", "title": "The Fault in Our Cutie Marks", "writer": "Ed Valentine; story by Josh Haber and Meghan McCarthy", "release_date": "2016-09-10"}, {"synopsis": "When the map sends Applejack and Fluttershy to solve a friendship problem in Las Pegasus, they come to a popular resort run by a generous pony named Gladmane. They have trouble finding a problem to solve until they encounter Flim and Flam in the middle of a feud. Fluttershy speculates that their mission is to help the brothers reconcile, but Applejack refuses out of her family's bitter history with them. Searching for problems elsewhere, they discover that Gladmane has been starting arguments between his employees, including Flim and Flam, in a ploy to gain their trust and continued services at the resort. Applejack reluctantly helps end Flim and Flam's argument and realizes their conniving ways are necessary to stopping Gladmane, so they devise an elaborate scheme that tricks Gladmane into publicly exposing his plans. Although the mission is a success, Flim and Flam promptly take over the resort to continue their scamming business together.", "subseason_ep_number": "20", "absolute_ep_number": "137", "title": "Viva Las Pegasus", "writer": "Kevin Burke & Chris \"Doc\" Wyatt; story by Michael Vogel, Kevin Burke & Chris \"Doc\" Wyatt", "release_date": "2016-09-17"}, {"synopsis": "Twilight notices that Starlight's progress with her friendship lessons has been slacking, so she assigns her with several activities to do with their friends while she and Spike are away in Canterlot for the day. Desperate to complete all her lessons at once to impress Twilight, Starlight hypnotizes her friends into carrying out their individual activities, but her poor directions cause them to make a total mess of the castle. Upon returning, Twilight lifts the spell on her friends and reprimands Starlight, saying that the true purpose of the activities was to get to know her friends better. After Starlight apologizes to them, they help her clean up the castle, and Starlight manages to complete her lessons in one day.", "subseason_ep_number": "21", "absolute_ep_number": "138", "title": "Every Little Thing She Does", "writer": "Michael Vogel", "release_date": "2016-09-24"}, {"synopsis": "Rarity, Pinkie Pie, and Applejack furiously return from a disastrous boating trip and refuse to speak to each other. Twilight and Spike question them over what went wrong, each giving a contradictory story that ends with their boat capsizing: Rarity blames Applejack for ruining her luxury cruise idea by steering the boat into a storm; Pinkie blames Rarity for getting rid of her party snacks; and Applejack blames both Rarity and Pinkie for disrupting her planned seafaring treasure hunt. After comparing the stories, Twilight notices a common thread in the form of a plate of cucumber sandwiches falling into bubbling water. She brings them on another cruise and proves that a cucumber-eating tri-horned bunyip is responsible for sinking the boat. Rarity, Pinkie, Applejack realize they have been fighting for no reason, and they promise to talk out their differences in the future.", "subseason_ep_number": "22", "absolute_ep_number": "139", "title": "P.P.O.V. (Pony Point of View)", "writer": "Michael P. Fox & Wil Fox; story by Kevin Burke, Chris \"Doc\" Wyatt, Michael P. Fox, & Wil Fox", "release_date": "2016-10-01"}, {"synopsis": "After Apple Bloom tells a white lie to hide a mistake, her family tells her a story of an even bigger fiasco caused by a series of lies Applejack told when she was a filly. In a flashback, Granny Smith disapproves of a rash business deal Applejack makes with Filthy Rich, who threatens to end business with the Apples when Applejack tries to back out. Because her family relies on the Rich family's funds, Applejack stops Filthy by falsely claiming that Granny is sick. To keep him from learning the truth, Applejack makes up a story that Granny is hospitalized with apple blight. When he and his fiancée Spoiled Milk go to visit her, Applejack convinces Granny to come to the hospital in a doctor's disguise and leaves her reluctant brother Big Mac to pose as Granny, who obliviously prepares to perform public surgery on him. This forces Applejack to tell everypony the truth, resulting in her present value of honesty.", "subseason_ep_number": "23", "absolute_ep_number": "140", "title": "Where the Apple Lies", "writer": "Dave Rapp; story by Meghan McCarthy & Dave Rapp", "release_date": "2016-10-08"}, {"synopsis": "Rainbow Dash finishes her spring training at the Wonderbolts Academy and heads home to spend her time off with her friends, but the map sends her and Twilight to solve a friendship problem back at the academy. When they arrive, they meet two particular trainees: the talented Sky Stinger and his seemingly less skilled partner Vapor Trail. While observing them, Rainbow Dash and Twilight recognize that Vapor, who dislikes being the center of attention, has been silently providing wind support for Sky, who fails to notice his own poor flight performance without her. Rainbow Dash and Twilight attempt to train them separately while keeping Sky from finding out Vapor's actions to maintain his confidence. When he cockily refuses to cooperate, Vapor blurts the truth to him, which ruins their friendship. Realizing they have approached the problem the wrong way, Rainbow Dash and Twilight persuade them to help each other, successfully allowing them to pass the academy entrance exam.", "subseason_ep_number": "24", "absolute_ep_number": "141", "title": "Top Bolt", "writer": "Joanna Lewis & Kristine Songco; story by Meghan McCarthy, Joanna Lewis, & Kristine Songco", "release_date": "2016-10-15"}, {"synopsis": "Starlight has been invited to the Sunset Festival at her old village, but she is afraid the townsfolk have not fully forgiven her after her cruel dictatorship, so she brings Trixie to accompany her. When they arrive, the townsfolk happily put Starlight in charge of the festivities, but she gets overwhelmed and flees. She and Trixie return to Ponyville to find Twilight and her friends being strangely dismissive of Starlight's misfortune at the village, despite showing their support earlier. During a nightmare that night, Princess Luna alerts Starlight that the changelings have returned and replaced herself and all of Equestria's protectors, including Twilight and her friends, in their plan to take over the kingdom. Thorax also approaches to warn Starlight and Trixie that his kind has taken over the Crystal Empire, and Discord, the last remaining powerful being in Equestria, teleports himself and the others to the Changeling Kingdom, where their friends are being held.", "subseason_ep_number": "25", "absolute_ep_number": "142", "title": "To Where and Back Again - Part 1", "writer": "Josh Haber & Michael Vogel", "release_date": "2016-10-22"}, {"synopsis": "Starlight, Trixie, Thorax and Discord set out to rescue their friends from the Changeling Kingdom, where their magic is negated by the power of Queen Chrysalis' enchanted throne. The others turn to Starlight to lead them, though despite her hesitations, she manages to direct the others in misguiding the changeling drones they encounter. When Discord is caught in a trap of Fluttershy impersonators, Trixie sacrifices herself to his impostor so Starlight and Thorax can find and destroy Chrysalis' throne. Thorax attempts to distract Chrysalis by disguising himself as Starlight, but Chrysalis sees through his deception and begins forcefully draining the love he has collected from the Crystal Empire. Encouraged by Starlight, Thorax willingly gives Chrysalis his love, causing a powerful burst of magic that metamorphoses him into a new form. His transformation inspires the other changelings to do the same, which destroys the throne and frees all of Starlight's captured friends. Rejecting Starlight's offer of redemption, Chrysalis vows revenge and flees. Thorax becomes the hive's new leader while Starlight returns to her village's festival with her friends.", "subseason_ep_number": "26", "absolute_ep_number": "143", "title": "To Where and Back Again - Part 2", "writer": "Josh Haber & Michael Vogel", "release_date": "2016-10-22"}], [{"synopsis": "Starlight, Trixie, Thorax, and Discord are awarded medals for defeating Queen Chrysalis and bringing harmony to the Changeling Kingdom. During the celebration reception, Discord makes Twilight realize that she has nothing left to teach Starlight, and turns to Princess Celestia for advice. Twilight considers following Celestia's example by sending Starlight to study away from Ponyville, and she becomes fraught with worry as she shows Celestia various scenarios of Starlight's studies all ending in a disaster. Celestia breaks into laughter and admits that she had the same anxieties over sending Twilight away out of fear of growing distant from her. Twilight feels assured and announces Starlight's graduation to the party goers. To Twilight's joy, Starlight decides to stay in Ponyville until she feels ready to leave.", "subseason_ep_number": "01", "absolute_ep_number": "144", "title": "Celestial Advice", "writer": "Joanna Lewis & Kristine Songco", "release_date": "2017-04-15"}, {"synopsis": "While Twilight and her friends are away on a friendship retreat, Starlight remains at the castle to help Trixie practice her magic. Trixie carelessly uses a teleportation spell on Twilight's map table, sending it to an unknown location. Starlight's rage causes a red cloud of magic to spew from her horn, which she contains in a glass bottle before it causes her to drive Trixie away. During their search for the map, Starlight's anger at Trixie continues to mount until the bottle accidentally breaks and releases the cloud, which infects Granny Smith, Bulk Biceps, and a jeweler pony, and makes them attack Trixie. Starlight is able to dispel the cloud by venting her anger to Trixie, who apologizes and Starlight apologizes for bottling up her anger. They find the map at the spa where they first met, and returns it to the castle just as Twilight and her friends came back.", "subseason_ep_number": "02", "absolute_ep_number": "145", "title": "All Bottled Up", "writer": "Joanna Lewis & Kristine Songco", "release_date": "2017-04-15"}, {"synopsis": "Shining Armor and Princess Cadance ask Twilight to babysit Flurry Heart while they attend an art show. Twilight gladly accepts the chance to spend time with her niece, despite her commitment to visiting sick foals at the hospital. When Twilight runs late for her appointment, she takes Flurry along to remain on schedule, proving to be too busy to give Flurry necessary attention. This causes Flurry to act out and cause problems everywhere they go, culminating with her wreaking havoc around the hospital while searching for her stuffed snail toy. Twilight scolds and frightens Flurry, but recognizes her negligence towards her niece and apologizes to her. Meanwhile, Shining Armor and Cadance begin to miss Flurry Heart and leave the art show early. They return to the castle to find Twilight spending quality time with her while Spike takes Twilight's place at the hospital. Twilight learns that she should not have agree to watch over her niece with a jam pack schedule and Shining Armor and Cadance learns that they should give Twilight notice ahead of time in case they need her to do foaling duties again.", "subseason_ep_number": "03", "absolute_ep_number": "146", "title": "A Flurry of Emotions", "writer": "Sammie Crowley & Whitney Wetta", "release_date": "2017-04-22"}, {"synopsis": "After Maud earns her \"rocktorate\" in rock science, Pinkie Pie takes her on a tour of Ponyville, hoping she will move in with her. Unimpressed with Ponyville's selection of rocks and minerals, Maud agrees to stay if she can make a friend who understands her passion for rocks. She meets Starlight, and they become fast friends as they unearth a beautiful grotto near Ponyville. However, Pinkie fails to notice their friendship and constantly tries forcing them to get along. Maud becomes annoyed with Pinkie's interference and inconsideration, and decides to move to Ghastly Gorge instead. Starlight scolds Pinkie for her inhospitality, causing her to realize her folly, so she apologizes to Maud for her behavior and selfishness and promises to never interfere again. This convinces Maud to give Ponyville a second chance, where she reunites with Starlight and sets up her new home in the grotto.", "subseason_ep_number": "04", "absolute_ep_number": "147", "title": "Rock Solid Friendship", "writer": "Nick Confalone", "release_date": "2017-04-29"}, {"synopsis": "When Ponyville's animal clinic is overrun with injured animals, Fluttershy decides to help by following her dream of building a wildlife sanctuary. Her friends recommend three experts to assist with the project: Wrangler, an animal handler; Hard Hat, a construction worker; and Dandy Grandeur, an interior decorator. However, each expert disagrees with Fluttershy's vision, and they begin work on a different structure without her consent, which proves to be unfit for the animals. Outraged at the experts for ignoring her directions, Fluttershy sends them away. After her friends apologize on behalf of the experts, she conspires with her friend, Big Daddy McColt, to complete the sanctuary her way, which is named \"Sweet Feather Sanctuary\".", "subseason_ep_number": "05", "absolute_ep_number": "148", "title": "Fluttershy Leans In", "writer": "Gillian M. Berrow", "release_date": "2017-05-06"}, {"synopsis": "Rarity feels nostalgic for her sisterly bonding with Sweetie Belle, so she decides to spend the day together with her. However, all of Rarity's planned activities are things Sweetie Belle has outgrown, which she fails to notice. After finally growing annoyed with Rarity and leaving her, Sweetie Belle joins Apple Bloom and Scootaloo in helping another filly, Zipporwhill, reconnect with her pet dog, who has similarly grown disinterested in playing with her. Sweetie Belle figures out that Zipporwhill has been treating her grown dog like a puppy, and encourages her to find new ways to play. Rarity overhears this and apologizes to Sweetie Belle for not thinking about and treating her like her age. They agree to try new activities together.", "subseason_ep_number": "06", "absolute_ep_number": "149", "title": "Forever Filly", "writer": "Michael P. Fox & Wil Fox", "release_date": "2017-05-13"}, {"synopsis": "Scootaloo is assigned to write a school report about her most inspirational hero, so she slingshots herself up to Cloudsdale to interview Rainbow Dash, but instead meets her parents, Bow Hothoof and Windy Whistles, who are just as big fans of their daughter as she is. They are delighted when Scootaloo tells them that Rainbow Dash is now a Wonderbolt, and visit their daughter to cheer for her. However, Rainbow Dash is mortified by her parents' overenthusiastic support, confiding in Scootaloo that she deliberately hid her induction from them for this reason. When her parents begin celebrating every mundane thing she does, Rainbow Dash snaps and angrily sends them away. Shocked and disappointed in her behavior, Scootaloo shows Rainbow Dash her report and helps her realize that her parents' support has built her into the confident and talented pony she is now, and she took them for granted, so she apologizes to her parents by performing a private Wonderbolts show for them to express her newfound appreciation.", "subseason_ep_number": "07", "absolute_ep_number": "150", "title": "Parental Glideance", "writer": "Josh Hamilton", "release_date": "2017-05-20"}, {"synopsis": "While Big Mac delivers another load of apples to Starlight’s old village, the Cutie Mark Crusaders stowed away and discovers that he has a crush on Sugar Belle, the unicorn who runs the bakery. They encourage Big Mac to confess his feelings, but he is interrupted by Feather Bangs, a suave stallion who also has affections for Sugar Belle. The Crusaders help Big Mac compete against Feather using grand, romantic gestures, but Sugar Belle is overwhelmed by their advances and rejects them both. The Crusaders decide to help Big Mac prepare a more meaningful gift for Sugar Belle by building her a new display case like she always wanted. Sugar Belle is delighted and accepts Big Mac's feelings, while the Crusaders decide to help Feather find new love with his own admirers.", "subseason_ep_number": "08", "absolute_ep_number": "151", "title": "Hard to Say Anything", "writer": "Becky Wangberg", "release_date": "2017-05-27"}, {"synopsis": "Rarity selects Applejack to serve as a judge for an upcoming fashion show. Applejack accepts, figuring that she simply needs to give her honest opinion. Before the show, Applejack is mystified by the other judges and stylists' fashion sense and criticizes their design choices, telling them her belief that fashion is ridiculous. The offended fashion ponies storm out, forcing the show to be cancelled. When Applejack tries defending her opinions by saying that she's giving her honest opinion, Rarity decides to show Applejack how honesty can be hurtful and gives her a taste of her own medicine by taking her to a pony who disregards apples, despite the hard work Applejack and her family put in the apples they make which also made Applejack realize how mean she was with her hurtful comments about fashion. Gathering the fashion ponies, Applejack apologizes for almost ruining the show with her honesty and manages to get the show uncancelled. When given the deciding vote during the show, Applejack finds new admiration in the stylists' hard work and names all of them the winner.", "subseason_ep_number": "09", "absolute_ep_number": "152", "title": "Honest Apple", "writer": "Kevin Lappin", "release_date": "2017-06-03"}, {"synopsis": "When the map sends Starlight to solve a friendship problem in Canterlot, she discovers that Princess Celestia and Princess Luna are feuding because they feel unappreciated by each other. The sisters start arguing over whose royal duties are more difficult, but Starlight casts a spell that temporarily switches their cutie marks and abilities, intending to make them swap roles to change their perspective. The sisters agree to Starlight's idea before quickly discovering their respective hardships: Luna finding it hard to keep up public appearances, and Celestia realizing the loneliness of guarding Equestria at night. While observing her subjects' dreams, Celestia finds Starlight suffering from a nightmare where the sisters' feud has escalated into a battle between Nightmare Moon and Celestia's evil alter ego, Daybreaker. With both sisters admitting their jobs are equally challenging, Celestia dispels Starlight's nightmare with Luna's support. The sisters finally reconcile, ending their feud.", "subseason_ep_number": "10", "absolute_ep_number": "153", "title": "A Royal Problem", "writer": "Joanna Lewis & Kristine Songco", "release_date": "2017-06-10"}, {"synopsis": "Pinkie Pie is invited to the rustic village of Yakyakistan, where she partakes in the yak holiday of Yikslurbertfest to prove her understanding of yak culture. During their customary stomping ritual, Pinkie and the yaks accidentally cause an avalanche that buries the village in snow, leaving them without food or shelter. Unable to dig the snow away on their own, Pinkie offers to gather her friends to assist the yaks, but Prince Rutherford stubbornly rejects any outside help and chooses to wait for the snow to melt instead. Pinkie disregards Rutherford and rallies her friends to remove the snow while they sleep. Awakening the next morning to find the snow gone, Rutherford and the yaks commend Pinkie for helping them without their asking, and make her an honorary yak.", "subseason_ep_number": "11", "absolute_ep_number": "154", "title": "Not Asking for Trouble", "writer": "May Chan", "release_date": "2017-06-17"}, {"synopsis": "After joining Fluttershy for a tea party, Discord realizes he has never invited her for tea before and takes it upon himself to change himself and his realm to be more normal in appeal to Fluttershy. When Fluttershy arrives, she sees that Discord is fading away, unable to make chaos. She rectifies the situation by creating chaos for him, which helps to restore him to normal. She reminds him that they get along so well because they are so different, and she was hoping to have a tea party under Discord's chaotic setting rather than one like her own.", "subseason_ep_number": "12", "absolute_ep_number": "155", "title": "Discordant Harmony", "writer": "Michael P. Fox & Wil Fox", "release_date": "2017-08-05"}, {"synopsis": "Apple Bloom encounters a kindly old pear merchant named Grand Pear in the market. When she tells Applejack and Big Mac about it, they tell her about a feud between the Apple and Pear families that Granny Smith refuses to talk about. Visiting Goldie Delicious for more information, the siblings discover that their mother, Buttercup, was Grand Pear's daughter Pear Butter. Through stories told by friends of their parents, the siblings learn about the romance between their mother and their father, Bright Mac, which is complicated by Grand Pear's plans to move away from Ponyville. Bright Mac and Pear Butter hold a secret wedding ceremony that is discovered by their parents as soon as they are married. Pear Butter asserts her place with the Apple family and cuts ties with her father when he refuses to accept their love. In the present, the Apple siblings arrange a meeting between Granny Smith and Grand Pear, allowing their estranged grandparents to apologize to them for hurting the family. After the reconciliation, the family gathers to honor their parents.", "subseason_ep_number": "13", "absolute_ep_number": "156", "title": "The Perfect Pear", "writer": "Joanna Lewis & Kristine Songco", "release_date": "2017-08-05"}, {"synopsis": "After encountering two feuding fillies, Twilight decides to publish her and her friends' friendship journal to teach ponies the lessons written inside. The journal becomes a success but draws unintended reactions from the readers: Rarity loses popularity for her supposed selfishness; Pinkie Pie is laughed at for her every word; Rainbow Dash is followed by fans who fixate solely on her entries; Fluttershy is criticized for her inconsistent assertiveness; Applejack is swamped by admirers who consider themselves a part of the Apple family; and Twilight is regarded as less interesting due to her princesshood. Confronted by a mob of critics who bicker over which pony is the best, Twilight and her friends try to convince them that their flaws are what make their friendship strong, but the mob only continue to argue. Twilight laments the journal's misinterpretation until Starlight finds the two fillies from before, who tell Twilight that the journal was able to help them become better friends, which satisfies the group, allowing them to embrace.", "subseason_ep_number": "14", "absolute_ep_number": "157", "title": "Fame and Misfortune", "writer": "M. A. Larson", "release_date": "2017-08-12"}, {"synopsis": "Spike invites Ember to Ponyville for an official friendship meeting, but forgot that he invited Thorax for a get-together on the same day. When both guests arrive, Spike fears they will not get along and decides to keep them separate. After this happens, the map sends Spike to solve a friendship problem in town, and he begins avoiding Ember and Thorax to find it. Ember confronts Spike for his suspicious behavior, causing Thorax to threaten her in Spike's defense. Spike is forced to reveal his deception to both of his friends, which upsets them. Eventually, they help each other work out their respective leadership problems. In the end, Ember and Thorax become friends and forgive Spike after he apologizes, fulfilling his friendship mission.", "subseason_ep_number": "15", "absolute_ep_number": "158", "title": "Triple Threat", "writer": "Josh Hamilton", "release_date": "2017-08-19"}, {"synopsis": "While the Cutie Mark Crusaders are starting their annual camping trip with Applejack, Rarity, and Rainbow Dash, a swarm of ravenous fly-ders infest the camp. Taking refuge in a cave, Applejack, Rarity, and Rainbow Dash decide to pass the time by telling folktales about their favorite legendary heroes. First, Applejack tells the story of Rockhoof, a scrawny earth pony stallion who magically grew big and strong while digging a trench to save his village from a volcanic eruption. Next, Rarity tells the story of Mistmane, a unicorn sorceress who sacrificed her beauty to lift a curse of ugliness on her embittered friend. Finally, Rainbow Dash tells the story of Flash Magnus, a pegasus soldier who bravely fought terrifying dragons with a fireproof shield to rescue his comrades. After the fly-ders leave, the Crusaders are inspired by the tales to make the best of their camping trip.", "subseason_ep_number": "16", "absolute_ep_number": "159", "title": "Campfire Tales", "writer": "Barry Safchik & Michael Platt", "release_date": "2017-08-26"}, {"synopsis": "On their way to visit to the Changeling Kingdom, Starlight and Trixie are attacked by Thorax's brother, Pharynx, who refuses to adopt the hive's new, peaceful ways. The other changelings feel uneasy around Pharynx and elect that he should be banished from the hive for his ceaseless bullying. Failing to reason with Pharynx, Starlight and Trixie agree that he must leave, but when they confront Thorax over the issue, he is reluctant because Pharynx would always defend him from being teased by the other changelings. Starlight is inspired to lure a maulwurf, a giant bear-mole creature, to the hive, expecting Pharynx to come to Thorax's rescue, only to find that he has already left willingly. Starlight, Trixie, and Thorax find him fending off the maulwurf to protect the hive, proving that he still cares for the changelings' safety. After working together to defeat the maulwurf, Pharynx is accepted by the other changelings and transforms.", "subseason_ep_number": "17", "absolute_ep_number": "160", "title": "To Change a Changeling", "writer": "Kevin Lappin", "release_date": "2017-09-02"}, {"synopsis": "Rainbow Dash is distressed when she and Pinkie Pie discover that A.K. Yearling has announced her retirement from writing the Daring Do book series, thus ending her adventures as the titular hero. When they confront her, Yearling explains she has grown disheartened over the collateral damage her heroics have caused in the city of the legendary hero Somnambula, resulting in her being despised by the townsfolk. They take Yearling to make amends, only to discover that Dr. Caballeron has been taking advantage of Daring Do's tarnished reputation to commit thefts and blame them on her. When Rainbow Dash speaks in Daring Do's defense, Caballeron kidnaps her, and lures Daring Do into a trap. Encouraged by Pinkie not to lose hope, Daring Do rescues Rainbow Dash and ends her retirement, regaining public support by exposing Caballeron's deception and using her wealth to repair the city damages.", "subseason_ep_number": "18", "absolute_ep_number": "161", "title": "Daring Done?", "writer": "Gillian M. Berrow", "release_date": "2017-09-09"}, {"synopsis": "While Rarity prepares for an important photo shoot, she gets her mane ruined by Pinkie Pie's sticky party string. Zecora gives a specially made shampoo to Rarity, but she accidentally takes a remover potion intended for Pinkie's mess instead and loses most of her mane. While Zecora works on a remedy, Rarity is devastated when other ponies fail to notice her as she hides her mane out of shame. Zecora later tells Rarity that a magical fix for her mane is impossible, and her friends cannot make her a suitable wig in time, so she reluctantly cancels the shoot. Reminded by her friends that her mane does not define who she is, Rarity refashions her thinned mane into a punk-inspired look and confidently returns to her daily routine. Months later, after Rarity's mane grew back, she is delighted to discover that her friends had arranged a paparazzi shoot with her in her punk style, starting a new fashion trend.", "subseason_ep_number": "19", "absolute_ep_number": "162", "title": "It Isn't the Mane Thing About You", "writer": "Josh Haber", "release_date": "2017-09-16"}, {"synopsis": "While helping Fluttershy gather supplies in a swamp, Zecora contracts a disease called swamp fever that threatens to eventually turn her into a tree, for which no cure is known. Holding herself responsible for Zecora's condition, Fluttershy vows to heal her as quickly as possible. After much sleepless research, Fluttershy finds a special honey first discovered by her idol, Mage Meadowbrook. By this time, Fluttershy contracts swamp fever as well, but continues to push herself for Zecora's sake until she passes out due to extreme exhaustion during a confrontation with the flash bees. Fluttershy reflects that her careless determination has only endangered Zecora, so she enacts a careful plan to extract the honey using Meadowbrook's mask as a disguise. After successfully treating Zecora and herself, Fluttershy apologizes for her impulsiveness, and has learned to do things carefully and logically.", "subseason_ep_number": "20", "absolute_ep_number": "163", "title": "A Health of Information", "writer": "Sammie Crowley & Whitney Wetta", "release_date": "2017-09-23"}, {"synopsis": "The Cutie Mark Crusaders open a day camp where \"blank flank\" foals may try new activities and discover their special talents. Rumble, the younger brother of Wonderbolt Thunderlane, refuses to participate and reveals his desire to remain a blank flank, as he is convinced that cutie marks limit ponies to only performing their talents. He quickly rallies the other campers to his side, splitting off into a new camp where they avoid doing anything that would produce a cutie mark, which quickly bores the campers. The Crusaders learn from Thunderlane that Rumble does not fear being labeled, but rather getting a cutie mark that could potentially keep him from achieving his dream of becoming a Wonderbolt. They invite Thunderlane to participate in the camp's activities with the campers and prove how he excels in other things besides flying, helping Rumble overcome his fear of trying different things.", "subseason_ep_number": "21", "absolute_ep_number": "164", "title": "Marks and Recreation", "writer": "May Chan", "release_date": "2017-09-30"}, {"synopsis": "Twilight learns that her parents have won a free zeppelin cruise and joins them to take a break from her royal duties. Shortly upon boarding, Twilight discovers the cruise to be a themed vacation experience hosted by Iron Will where the other passengers pay to spend time with her, invading her family's privacy. Not wanting to disappoint anypony, Twilight agrees to personally attend to the passengers so the rest of her family can enjoy their planned activities. In doing so, however, she misses a rare celestial event she had planned to see and is heartbroken, and she hurts Star Tracker, a colt who won a day of being an honorary member of her family, in the process. Cadance consoles Twilight, telling her the importance of setting time aside for herself. After Twilight apologizes to the passengers and Star Tracker, they agree to respect her boundaries and turn against Iron Will for manipulating them and almost ruining their time together, forcing him to abandon the cruise and allowing Twilight to spend the rest of her vacation in peace with her family.", "subseason_ep_number": "22", "absolute_ep_number": "165", "title": "Once Upon a Zeppelin", "writer": "Brittany Jo Flores", "release_date": "2017-10-07"}, {"synopsis": "Pinkie Pie has been giving homemade pies to Rainbow Dash for years and is shocked to find that she has apparently thrown her latest one away. After investigating around Ponyville and Wonderbolt headquarters, Pinkie realizes that Rainbow Dash has never actually eaten any of her pies and has been lying about enjoying them. After several attempts to get Rainbow Dash to eat a pie, Pinkie finally catches her getting rid of one and publicly accuses her of deception. Rainbow Dash admits to Twilight and Applejack that she dislikes all pies, and has only been lying to spare Pinkie's feelings, but they tell her that she did hurt her. Rainbow Dash bakes a huge, disgusting pie and prepares to eat it in front of Pinkie as an apology, but Pinkie forgives her before she can finish, now understanding the lengths to which Rainbow Dash would go to make her happy. She tells Rainbow Dash that in the future, she can always be honest with her, no matter what.", "subseason_ep_number": "23", "absolute_ep_number": "166", "title": "Secrets and Pies", "writer": "Josh Hamilton", "release_date": "2017-10-14"}, {"synopsis": "Sunburst comes to visit Ponyville, exciting Starlight with the opportunity to spend time with him for the first time since their childhood. To her dismay, Sunburst has little interest in their old activities and finds more in common with her other friends, bonding with Twilight over antiquing, Trixie over stage magic, and Maud over geology. Starlight attempts to reach out to him through their shared interest in magic by casting a spell to recreate their childhood, but her effort only makes Sunburst feel uncomfortable, convincing Starlight that they have nothing in common anymore. After Sunburst fails to find what he and Starlight still have in common, he decides to make it up to her by creating a new variation of their favorite board game, showing her that they can still enjoy each other's company without common interests. With their friendship reaffirmed, Sunburst leaves Ponyville with an antique barrel containing a journal marked with Star Swirl the Bearded's insignia.", "subseason_ep_number": "24", "absolute_ep_number": "167", "title": "Uncommon Bond", "writer": "Josh Haber & Kevin Lappin", "release_date": "2017-10-21"}, {"synopsis": "Sunburst shares his discovery of Star Swirl the Bearded's journal with Twilight and her friends, which reveals how the sorcerer and Equestria's other legendary heroes, known as the Pillars of Old Equestria, sacrificed themselves to defeat the Pony of Shadows a thousand years ago. While researching the six heroes' disappearance, Twilight and the group deduce that the Pillars are still alive in limbo, where they have imprisoned themselves alongside the Pony of Shadows for the past millennium. Against Starlight's reservations, Twilight is convinced that freeing Star Swirl would benefit Equestria with his knowledge. To do this, each of Twilight's friends obtains one of the Pillars' artifacts scattered across the land and gathers them to the site of the sealing ritual. Although they succeed in releasing the Pillars, doing so accidentally brings the Pony of Shadows back as well.", "subseason_ep_number": "25", "absolute_ep_number": "168", "title": "Shadow Play - Part 1", "writer": "Josh Haber & Nicole Dubuc; story by Josh Haber", "release_date": "2017-10-28"}, {"synopsis": "With his newfound freedom, the Pony of Shadows retreats to the darkest corners of Equestria to recover his lost strength. Scolded by Star Swirl for breaking his spell, Twilight resolves to redeem herself by helping him and the Pillars return the Pony of Shadows to limbo, this time by sacrificing the Elements of Harmony in their place. The map directs them to the monster's location in the Hollow Shades, but Starlight believes this is a friendship problem and learns from the Pillars that the Pony of Shadows was once their friend named Stygian, whom they cast out for attempting to steal their artifacts. When the group arrives at the Hollow Shades, they use the Elements on the Pony of Shadows, but Twilight and Starlight see Stygian and reach out to him, learning that his supposed betrayal was actually an attempt to help the Pillars protect Equestria. The Pillars realize their mistake and help Twilight and her friends use the Elements to separate Stygian from the shadow entity, which is reimprisoned. Star Swirl apologises for all the trouble he caused with his pride. With their friendship restored, Stygian and the Pillars remain in the present era to explore Equestria.", "subseason_ep_number": "26", "absolute_ep_number": "169", "title": "Shadow Play - Part 2", "writer": "Josh Haber & Nicole Dubuc; story by Josh Haber", "release_date": "2017-10-28"}], [{"synopsis": "Shortly after the Storm King's defeat, Twilight and her friends return home to discover that the map has expanded to cover lands beyond Equestria. Realizing there are so many creatures who know nothing about friendship, Twilight decides to open a school where they can come to learn all about it and receives approval from the Equestria Education Association, who expect her to do things their way. On the school's opening day, Twilight appoints her friends as the teachers and welcomes five students from all the kingdoms to attend: Gallus, a sarcastic griffon; Yona, a clumsy yak; Smolder, a cocky dragon; Ocellus, a timid changeling; and Silverstream, an excitable hippogriff. They initially enjoy the school, but soon grow bored of the EEA's strict teaching guidelines, so they decide to skip class with their pony classmate Sandbar. As they are becoming friends, they accidentally wreak havoc on the school during an evaluation conducted by Chancellor Neighsay, head of the EEA. Convinced that the non-pony students are dangerous, Neighsay immediately shuts the school down.", "subseason_ep_number": "01", "absolute_ep_number": "170", "title": "School Daze - Part 1", "writer": "Michael Vogel & Nicole Dubuc", "release_date": "2018-03-24"}, {"synopsis": "Twilight becomes depressed over her school being unaccredited until Starlight encourages her to try again without following the EEA's rules. She and her friends attempt to convince the other kingdoms' leaders to let their students return to the school, only to learn that the students have all run away from home, unwilling to part with each other. They discover that Sandbar has been hiding the students at the Castle of the Two Sisters in the Everfree Forest, where they rescue them from being attacked by a horde of porcupine-like pukwudgies. The students agree to give the school another chance after Twilight and her friends assure them things will be different. Chancellor Neighsay confronts Twilight for her unauthorized reopening of the school, but she asserts her authority as Princess of Friendship and writes her own set of school rules. Twilight's friends use unique teaching methods to make the school more appealing, and the leaders allow their students to continue their studies in Equestria.", "subseason_ep_number": "02", "absolute_ep_number": "171", "title": "School Daze - Part 2", "writer": "Michael Vogel & Nicole Dubuc", "release_date": "2018-03-24"}, {"synopsis": "Pinkie Pie learns that her sister Maud is dating a stallion named Mudbriar, who has an interest in sticks similar to Maud's interest in rocks and is as outwardly dull and blunt as she is. Although Maud and Mudbriar are happy together, Pinkie fails to notice their similarities, finding Mudbriar's personality and quirks to be annoying and strange. Unable to comprehend their relationship, Pinkie eventually becomes convinced that Maud prefers Mudbriar over her and flees to her family's rock farm in despair. After her sisters Limestone and Marble help her realize that Maud's happiness with Mudbriar is all that matters, Pinkie returns and makes peace with Mudbriar, putting up with him for Maud's sake.", "subseason_ep_number": "03", "absolute_ep_number": "172", "title": "The Maud Couple", "writer": "Nick Confalone", "release_date": "2018-03-31"}, {"synopsis": "Rarity leaves Fluttershy in charge of her boutique in Manehattan while she is out of town for a fashion show in Canterlot. Fluttershy is intimidated by the pushy customers, so Rarity advises her to wear an outfit to boost her confidence. Taking Rarity's advice to heart, Fluttershy begins dressing up and acting out different characters to match her customers' personalities, which helps the store's sales. However, she takes her role playing so far that she begins driving customers away with her rude behavior, getting rid of her raccoon helpers as well. The raccoons bring Fluttershy's friends to help, but she kicks them out of the store. Her friends then turn to Rarity, who fires Fluttershy, bringing her back to her senses. Fluttershy apologizes to her friends, and Rarity assures her that she already has the inner strength needed to succeed.", "subseason_ep_number": "04", "absolute_ep_number": "173", "title": "Fake It 'Til You Make It", "writer": "Josh Hamilton", "release_date": "2018-04-07"}, {"synopsis": "Rainbow Dash is eager to ride the Wild Blue Yonder, a famous roller coaster in Las Pegasus, before it permanently closes. Applejack agrees to take over her classes at the School of Friendship if she chaperones Granny Smith and her elderly relatives for their annual Las Pegasus vacation, strictly instructing her to never let them overexert themselves or leave her sight. Rainbow Dash reluctantly accepts and attempts to convince the grannies to rest in their hotel so she can have time for herself. However, the grannies sneak off while Rainbow Dash discovers the coaster's long waiting line, forcing her to spend most of the day following them and interfering with their exciting activities, much to their annoyance. When Rainbow Dash apologizes for ruining their fun and explains she is only following Applejack's instructions, the grannies laugh over Applejack's overprotectiveness and invite Rainbow Dash to ride the coaster with them, using their VIP passes to skip the line.", "subseason_ep_number": "05", "absolute_ep_number": "174", "title": "Grannies Gone Wild", "writer": "Gillian M. Berrow", "release_date": "2018-04-14"}, {"synopsis": "When the map sends the Cutie Mark Crusaders to solve a friendship problem in the hippogriffs' kingdom on Mount Aris, where half of its citizens have decided to live in their underwater home of Seaquestria as seaponies, they meet Silverstream's brother Terramar, who cannot decide whether he belongs on land with his father or underwater with his mother. The Crusaders are unable to agree among themselves, with Sweetie Belle arguing for the mountain's captivating landscape while Scootaloo favors the fun of swimming with the sea creatures, which makes Terramar even more indecisive. The Crusaders arrange a gathering of hippogriffs and seaponies at the shoreline for Terramar, whose parents tell him he is not limited to choosing one place to live. Encouraged, Terramar settles on living as both a hippogriff and a seapony.", "subseason_ep_number": "06", "absolute_ep_number": "175", "title": "Surf and/or Turf", "writer": "Brian Hohlfeld", "release_date": "2018-04-21"}, {"synopsis": "Twilight organizes a stage play honoring the anniversary of Princess Celestia's first raising of the sun. Learning that Celestia has never been in a play despite her love of theater, Twilight offers her the lead role, much to Celestia's glee. As Rainbow Dash excitedly spreads the word all across Equestria, however, Twilight is mortified by Celestia's poor acting skills and fears that she will humiliate herself in front of her subjects. Applejack suggests to Twilight that she should tell Celestia the truth, but she refuses to listen because she does not want to hurt Celestia's feelings. When the day of the play arrives and Celestia's performance has not improved, Twilight panics and unwittingly vents her frustrations with Celestia, who overheard everything she said, causing her to storm off because Twilight was not honest with her. Twilight apologizes to Celestia for lying and admits she only intended to repay her for her years of guidance. Celestia agrees to help Twilight salvage the play by directing the other actors from backstage, making it a success.", "subseason_ep_number": "07", "absolute_ep_number": "176", "title": "Horse Play", "writer": "Kaita Mpambara", "release_date": "2018-04-28"}, {"synopsis": "Starlight and Sunburst are disappointed when they learn the map has sent them to solve a friendship problem in their old hometown, Sire's Hollow, because of their strained relationship with their parents: Firelight, Starlight's over-affectionate father, and Stellar Flare, Sunburst's domineering mother. They are further dismayed when their mission appears to be settling a feud between their parents, but realizes it was not the problem after they quickly ended the fighting. Starlight and Sunburst try to avoid their parents as much as possible while they look for their real mission, only for their parents to continually meddle with their search. After finally snapping at their parents for their unwanted interference, Starlight and Sunburst realize their estrangement from them is the problem they were summoned to solve. They complete their mission by apologizing to their parents, who agree to give them more independence.", "subseason_ep_number": "08", "absolute_ep_number": "177", "title": "The Parent Map", "writer": "Dave Rapp", "release_date": "2018-05-05"}, {"synopsis": "Applejack and Rainbow Dash compete with each other to receive the \"Teacher of the Month\" award at the School of Friendship. Twilight selects them to lead a field trip together to teach their students about teamwork, but their constant bickering over which activities they should do creates problems. Persuading Twilight to give them another chance, they continue the trip by letting the other take the lead, which takes up more of their focus than teaching their students. When their polite argument over making a bridge leaves them stuck over a river, the students work together to save them. The students vouch for them as teacher of the month by telling Twilight that they were arguing on purpose to teach them the incorrect way of working as a team, but Twilight catches on to the truth, causing Applejack and Rainbow Dash to argue all over again.", "subseason_ep_number": "09", "absolute_ep_number": "178", "title": "Non-Compete Clause", "writer": "Kim Beyer-Johnson", "release_date": "2018-05-12"}, {"synopsis": "On Hearts and Hooves Day, Big Mac sends a romantic package to Sugar Belle, but it got lost in the mail and sent to Sweetie Belle by mistake. When Big Mac notices Sugar Belle at Sugarcube Corner later, he overhears her talking with Mrs. Cake about ending a relationship with someone and concludes that she means to break up with him, which breaks his heart. Spike and Discord attempt to console Big Mac, with Discord suggesting he assert himself by breaking up with Sugar Belle before she does. After he does so, breaking her heart, Big Mac realizes he has only been letting out his frustrations and returns to Sugar Belle to have a proper conversation over their breakup. Sugar Belle reveals that she never received Big Mac's package and had actually planned to end her business relationship with her cousin so she could begin working in Ponyville. Realizing their miscommunication, they get back together while learning a lesson about proper communication rather than assuming and eavesdropping.", "subseason_ep_number": "10", "absolute_ep_number": "179", "title": "The Break Up Break Down", "writer": "Nick Confalone", "release_date": "2018-05-19"}, {"synopsis": "Spike begins experiencing bizarre body changes such as pimple-like blemishes, losing control of his fire breath, and emitting foul stenches. Smolder explains that Spike is molting, which all dragons undergo during adolescence, and she adds that the molting process typically causes dragons to be kicked out of their homes, which Spike worries is the case when Twilight tells him to leave the castle to keep him from accidentally burning their belongings. When he visits Zecora for a solution, his smell unwittingly attracts a predatory roc that catches Zecora, and Rarity. Spike molts all of his skin to find he has grown a pair of wings, which allows him to fend the roc off and rescue his friends. Afterward, Twilight assures Spike that she has no intention of getting rid of him and promises to help him get used to his changes.", "subseason_ep_number": "11", "absolute_ep_number": "180", "title": "Molt Down", "writer": "Josh Haber", "release_date": "2018-05-26"}, {"synopsis": "Bored with their ordinary classes, the Cutie Mark Crusaders attempt to enroll at the more exciting School of Friendship, but Twilight turns them away, saying they already know about friendship. The Crusaders later meet a young student from the school named Cozy Glow, who is struggling with her homework, and figure that helping her would be just as good as attending Twilight's school. Cozy aces her assignment under their tutelage and asks them to help her prepare for an upcoming test. When Cozy fails the test and explains the Crusaders' involvement, Twilight believes they gave her poor guidance on purpose and bans them from the school grounds. Later, Cozy confesses that she failed her test on purpose to make Twilight consider accepting the Crusaders as students like they wanted. After Cozy apologizes to the Crusaders, Twilight, in an act of penance for her poor judgement, allows them back in the school and gives them honorary diplomas, granting them positions at the school as official friendship tutors.", "subseason_ep_number": "12", "absolute_ep_number": "181", "title": "Marks for Effort", "writer": "Nicole Dubuc", "release_date": "2018-06-02"}, {"synopsis": "Queen Chrysalis creates evil clones of Twilight and her friends so she can seize control of the Elements of Harmony and exact her revenge on Starlight. Chrysalis and the clones search for the Elements in the Everfree Forest, where Twilight and her friends are on a camping trip. Wandering off from each other, the group encounters the clones, who mistreat and insult them. Mistaking the clones for their actual friends, they get into a heated argument when they eventually regroup. However, Twilight quickly manages to resolve the argument, and they happily resume their trip. Meanwhile, Chrysalis and the clones find the Tree of Harmony, but the Elements destroy the clones when they attempt to use them to betray Chrysalis, who once again swears revenge on Starlight.", "subseason_ep_number": "13", "absolute_ep_number": "182", "title": "The Mean 6", "writer": "Michael Vogel", "release_date": "2018-06-09"}, {"synopsis": "When the map sends Twilight and her friends to solve a friendship problem far away from Ponyville, Twilight leaves Starlight to run the school and do a scavenger hunt while they are gone. Discord appears and offers to help out, but Starlight refuses. Discord begins to unleash chaos on the school with Starlight trying to control each situation. She gets fed up with his antics and banishes him from the school grounds with her magic. The scavenger hunt goes underway afterwards, but Discord, manifesting as a ghost, sabotages it. Starlight realizes what she did to Discord was wrong in turning down his offer to help and apologizes to him. She unbanishes Discord and offers him the position of vice headmare. He accepts it and helps re-do the scavenger hunt. However, Twilight and her friends return and reveal that Discord created a fake friendship mission to send them away, but thanks Starlight for helping run the school.", "subseason_ep_number": "14", "absolute_ep_number": "183", "title": "A Matter of Principals", "writer": "Nicole Dubuc", "release_date": "2018-08-04"}, {"synopsis": "As the School of Friendship is about to go on winter break, a cloaked figure covers the Hearth's Warming Eve decorations in purple goo. Twilight, Rainbow Dash, and Spike chase the figure into the students' dormitory, but does not see it leave, leading them to conclude that one of them is responsible. The guilty party will have to stay over the break for extra friendship lessons, and if none of them confesses, all of them will stay and miss the holidays. As the students begin cleaning up and Rainbow Dash calls them in for questioning, they describe the way their respective cultures celebrate the holidays. None of them confesses, leading to accusations and arguments that eventually prompt Gallus to admit that he pulled the prank, because he wanted to stay on campus with his friends instead of going home to Griffonstone and its dreary celebration. Having overheard, Twilight thanks him for his honesty, but says that he must still face punishment. The other students volunteer to stay with Gallus, and Twilight invites the entire group to celebrate Hearth's Warming with her and her friends.", "subseason_ep_number": "15", "absolute_ep_number": "184", "title": "The Hearth's Warming Club", "writer": "Brian Hohlfeld", "release_date": "2018-08-04"}, {"synopsis": "When Twilight learns that a new friendship school has opened in Las Pegasus, she and Rarity travel there to check it out. The school, Friendship University, is run by Flim and Flam and has enrolled Star Swirl, to Twilight's shock, and Chancellor Neighsay grants it full accreditation. Twilight and Rarity begin to investigate, with Rarity taking classes and Twilight sneaking into the brothers' office to search for evidence that the school is a fraud. They catch her in the act and threaten to publish a photo of the break-in to ruin her reputation. Twilight accepts at first in the face of Star Swirl's disapproval, but Rarity persuades her not to give up, and Twilight realizes her reputation is worth anything if she does not stand up for what is right. They soon discover that the brothers are charging high fees for the worksheets needed to complete the coursework, based on a stolen copy of Twilight's own curriculum, and planning to use the money to expand their resort. When Star Swirl learns of the scheme, he intimidates them into refunding the students' money and shutting down Friendship University. He promises to attend the School of Friendship if he needs lessons in the future, but Twilight and Rarity are left wondering how Flim and Flam could have gotten Twilight's lesson plans.", "subseason_ep_number": "16", "absolute_ep_number": "185", "title": "Friendship University", "writer": "Chris \"Doc\" Wyatt & Kevin Burke", "release_date": "2018-08-11"}, {"synopsis": "While helping Twilight teach a class on compromise, Rainbow Dash and Rarity get into an argument on how to spend their day off. Twilight and the students accompany them for a practical demonstration, but neither shows much interest in the other's pursuits, and they get so annoyed with each other that they declare their friendship to be at an end. Starlight tries in vain to reconcile them, but receives word that a magical artifact has been stolen from the school. Rainbow Dash and Rarity are dispatched to track it down, but continue to aggravate one another as they follow the artifact's trail to a swamp. Working together, they cross safely to the far shore, follow the trail up a mountainside, and find a secret passage that leads back to campus. There they learn that Twilight, Starlight and Spike faked the theft to remind them of their friendship. Having developed a new appreciation for each other's interests, Rainbow Dash and Rarity leave to go shopping for some new buckball playing gear and fan attire.", "subseason_ep_number": "17", "absolute_ep_number": "186", "title": "The End in Friend", "writer": "Gillian M. Berrow", "release_date": "2018-08-18"}, {"synopsis": "Pinkie Pie has taken up the yovidaphone, a popular instrument in Yakyakistan, but her inept practicing becomes an annoyance to the residents of Ponyville. Her friends let her keep at it, hoping that she will improve, however, her playing remains as bad as ever and starts to interfere with their daily lives. She abandons the instrument at their urging, outwardly cheerful but secretly heartbroken. When the others realize her true emotional state, they try in vain to reengage her in activities that she enjoys and is good at. A few days later, they learn from Maud that Pinkie is moving to Yakyakistan and travel there to find her listening to a performance by a yovidaphone master. The music depresses her even further, since she is convinced, she will never play that well. With a bit of encouragement from her friends, Pinkie plays the master's yoviaphone, and even though her playing is as discordant as before, she regains her happy temperament and earns an ovation from the yaks in the audience, since the master explains that the whole point of the yovidaphone is to bring joy to those who play it.", "subseason_ep_number": "18", "absolute_ep_number": "187", "title": "Yakity-Sax", "writer": "Michael P. Fox & Wil Fox", "release_date": "2018-08-25"}, {"synopsis": "After a successful magic show in Ponyville, Trixie decides to do a tour in Saddle Arabia and takes Starlight along. They get along well at first but start to get on each other's nerves once they reach the desert village of Somnambula. Starlight's reckless spending leaves them short of money, and they have to spend the night in Trixie's cramped wagon since all the inns are full. They aggravate each other all night long, and the next day degenerates into an exchange of insults. The next day, Starlight trades Trixie's wagon for a larger one without telling her. Furious, Trixie sends her home with it and tries to continue the tour alone. Starlight eventually returns to apologize for making the trade, and they persuade its original owner, a Saddle Arabian unicorn named Hoo'Far, who had enjoyed the show in Ponyville, to return Trixie's wagon by embarrassing themselves in front of him for the sake of friendship. Returning to Ponyville, Trixie and Starlight are happy for at least having made the attempt and for learning that they should not do it again.", "subseason_ep_number": "19", "absolute_ep_number": "188", "title": "Road to Friendship", "writer": "Josh Haber", "release_date": "2018-09-01"}, {"synopsis": "When Rainbow Dash learns that Scootaloo has taken an interest in a stunt team called the Washouts, she fears she may lose her number-one fan. The team's show is filled with dangerous tricks that impress Rainbow Dash in spite of herself, and she discovers that all the members have been thrown out of the Wonderbolts, including her old rival Lightning Dust. Their refusal to follow basic safety protocols worries Rainbow Dash, but neither she nor Spitfire can disabuse Scootaloo of her fascination with the Washouts. In a fit of rebellion, Scootaloo joins the team so she can have a chance to do something amazing despite being unable to fly. Lightning Dust pressures her into doing an extremely dangerous, untested ramp jump on a rocket-powered scooter, but Rainbow Dash saves her just in time and the scooter drags Lightning Dust away into the sky. They apologize to one another, with Scootaloo not seeing the danger Lightning Dust put her in and Rainbow Dash not being a better role model and making Scootaloo feel like she will not be as awesome as her, and she starts a new fan club in Scootaloo's honor.", "subseason_ep_number": "20", "absolute_ep_number": "189", "title": "The Washouts", "writer": "Nick Confalone", "release_date": "2018-09-08"}, {"synopsis": "After Rockhoof causes damage to the site of his old village during an archaeological dig, Twilight hires him as a teacher at the School of Friendship. Although the students are captivated by his story of fighting an Ursa Major, he accidentally disrupts classes all over campus while telling it and fighting what he thinks is an out-of-control fire. Twilight and her friends try to find Rockhoof a job in Ponyville, without success, and she and Applejack take him to visit the other Pillars and see how they have adapted to modern society. The visits leave Rockhoof more dejected, and after accidentally steering a hippogriff naval vessel aground, he decides to have Twilight turn him into a statue. Yona persuades him to reconsider by reading him an essay on heroism she wrote for class, and he finds that the entire town is eager to hear the rest of his Ursa Major story. Recognizing that Rockhoof can serve as a living connection to Equestria's past, Twilight appoints him as the realm's Keeper of Tales.", "subseason_ep_number": "21", "absolute_ep_number": "190", "title": "A Rockhoof and a Hard Place", "writer": "Kaita Mpambara", "release_date": "2018-09-15"}, {"synopsis": "The Young Six's worries over an upcoming exam are worsened by Cozy Glow's comments that friendship goes against the non-pony students' nature. When a light shining from a floor grate in the School of Friendship's library leads them to a network of caverns, an image of Twilight puts them through a series of tests that they must pass in order to escape. The students are confronted with their worst fears, but they help each other to overcome them and prove to the phantom Twilight, which is actually the Tree of Harmony, that they do understand the nature of friendship. Once they return to the library, exhausted from the night's adventure, Cozy apologizes for her earlier words and arranges for them to get an extension on their exam.", "subseason_ep_number": "22", "absolute_ep_number": "191", "title": "What Lies Beneath", "writer": "Michael Vogel", "release_date": "2018-09-22"}, {"synopsis": "When the map sends Applejack and Fluttershy to solve a friendship problem in the Peaks of Peril, they find a village inhabited by peaceful creatures called the Kirin, who do not speak or show any emotion. A talkative outcast Kirin named Autumn Blaze explains to Applejack that an argument between the Kirin once caused them to turn into angry, fiery creatures called the Nirik and burn down their village. They bathed in a magic stream that cooled their emotions, but also silenced their voices. Autumn later found a flower that allowed her to speak again, but the village became irritated with her chatter and exiled her. Applejack and Fluttershy argue over the wisdom of giving the cure to the others, leading the Kirin to carry them toward the stream, but Autumn arrives as a Nirik to stop them. Reverting to Kirin form, she convinces the others that they can channel any anger they feel into non-destructive outlets. After a group of squirrels leads Applejack and Fluttershy to the flowers that Autumn used for the cure, the Kirin regain their voices and welcome Autumn back to the village.", "subseason_ep_number": "23", "absolute_ep_number": "192", "title": "Sounds of Silence", "writer": "Gregory Bonsignore", "release_date": "2018-09-29"}, {"synopsis": "As Twilight starts to worry that Spike's upbringing among ponies may have held him back in exploring his dragon heritage, a dragon named Sludge crash-lands in Ponyville. Spike takes him back to the castle so he and his friends can help him recover from his injuries, and Sludge reveals that he is Spike's father and has been trying to find him for years. As Spike and Sludge spend time together, Sludge persuades Spike to give up his comfortable lifestyle in the castle, while secretly planning to move in and enjoy its luxuries for himself. When Twilight expresses her concerns, Spike accuses her of being jealous that he has a real parent in his life, which hurts Twilight's feelings, and Smolder is unimpressed with Sludge's loafing and tells Spike that dragons should not act that way. With her help, Spike tricks Sludge into thinking that both of them are going to move out of the castle and into a cave. Sludge admits he is not Spike's father and leaves, and Spike apologizes to Twilight and acknowledges her as his family.", "subseason_ep_number": "24", "absolute_ep_number": "193", "title": "Father Knows Beast", "writer": "Josh Haber", "release_date": "2018-10-06"}, {"synopsis": "After a malfunctioning spell endangers the students, Twilight and her friends discover that magic is failing across Equestria. Upon Cozy Glow's suggestion, they travel to Tartarus to interrogate Lord Tirek. At the school, Cozy assumes the role of headmare despite Twilight appointing Starlight. Chancellor Neighsay then seizes control from her and detains the Young Six, believing them to be responsible for the failing magic. Faking a betrayal to escape, Sandbar went to get the Cutie Mark Crusaders for help. Meanwhile, Tirek reveals to Twilight and her friends that he has been exchanging letters with a protégé to help him exact revenge on the group by trapping them in Tartarus. While searching underneath the school, Sandbar and the Crusaders discover that Cozy is using the school's magical artifacts to imprison Starlight and drain all of the magic from Equestria, intending to rule it as the Empress of Friendship.", "subseason_ep_number": "25", "absolute_ep_number": "194", "title": "School Raze - Part 1", "writer": "Nicole Dubuc", "release_date": "2018-10-13"}, {"synopsis": "At the school, Cozy Glow turns the students against Chancellor Neighsay, traps him in his office and regains control of the school. Sandbar frees the rest of the Young Six who free Neighsay and formulate a plan to remove the artifacts to shut down the magic-eating spell. Cozy turns the other students against the Young Six by claiming they are responsible for the disappearing magic. In the struggle, the Young Six get trapped in the spell's vortex, but are rescued by the Tree of Harmony's magic. Removing the artifacts, the spell is shut down and magic everywhere is restored. Having escaped Tartarus by coercing Tirek's help, Twilight and her friends prevent Cozy's escape and Twilight tries to explain to her that gaining power is not the purpose of friendship and apologizes to her for not being able to teach her that lesson. Neighsay returns control of the school to Twilight, having learned that non-ponies are equally capable of friendship. Now imprisoned in Tartarus, Cozy asks Tirek if he wants to be friends with her.", "subseason_ep_number": "26", "absolute_ep_number": "195", "title": "School Raze - Part 2", "writer": "Josh Haber", "release_date": "2018-10-13"}], [{"synopsis": "Twilight and her friends have been urgently called to Canterlot by Princess Celestia and Princess Luna, who announces that they are retiring from ruling Equestria and they want Twilight to take their place in a few days, which makes her completely overwhelmed. Meanwhile, Queen Chrysalis, Lord Tirek, Cozy Glow, and a resurrected King Sombra are summoned by Grogar, an ancient evil ram and Equestria's original emperor, who proposes that they all work together to defeat Twilight and her friends and take over the kingdom. However, Sombra rejects Grogar’s offer and sets out to reclaim the Crystal Empire on his own. Although he succeeds by enslaving everypony, including Shining Armor, Princess Cadance and Flurry Heart, Twilight and her friends arrive and easily defeat him with the Elements of Harmony. They venture back to the Tree of Harmony to return the Elements, but Sombra suddenly appears and destroys the Tree and the Elements.", "subseason_ep_number": "01", "absolute_ep_number": "197", "title": "The Beginning of the End - Part 1", "writer": "Joanna Lewis & Kristine Songco", "release_date": "2019-04-06"}, {"synopsis": "Sombra reveals to Twilight and her friends that he faked his defeat in order to find and destroy the source of their powers. He traps them in the cave and moves on by claiming Ponyville, mind controlling all of the townsfolk and sending them all to lay siege on Canterlot. The group manage to escape and head their way to the town but are blocked by living plants from the Everfree Forest. Celestia and Luna arrive alongside Star Swirl to stop the plants as the group quickly head to Canterlot. Confronting Sombra, they are unable to fight back without the Elements, so Discord appears and easily outdoes his magic attacks, but is fake injured after intercepting a full blast heading towards Fluttershy. After a sentimental speech from Discord, Twilight and her friends come together saying they are embodiments that represent friendship and that can never be taken away, and they defeat Sombra once more. Celestia and Luna congratulate them in their victory and apologize to Twilight for pushing their position too quickly onto her, stating that she will be ready when the time is right. Meanwhile, Grogar uses Sombra's defeat as a warning to the other villains to do things his way.", "subseason_ep_number": "02", "absolute_ep_number": "198", "title": "The Beginning of the End - Part 2", "writer": "Joanna Lewis & Kristine Songco", "release_date": "2019-04-06"}, {"synopsis": "The Young Six are visited by a spiritual embodiment of Twilight, who says the Tree of Harmony needs them. After they learn from Twilight herself that the tree has been destroyed, they decide to memorialize it. However, they have conflicting and opposing plans to honor the tree, resulting in a big mess within the cave where it once stood. Yona urges the others to remember the tree as the thing that united them as friends, to which the group use its remains to build a tree house. Much to their surprise, a new tree bursts upward from the cave floor, tearing a hole in the ceiling and creating a new and even larger tree house on the grounds of the Castle of the Two Sisters. The spirit of the Tree appears before them, saying that the tree house can serve as a sanctuary for them and for future generations, and Twilight realizes the tree is still alive and adapting to be whatever Equestria needs.", "subseason_ep_number": "03", "absolute_ep_number": "199", "title": "Uprooted", "writer": "Nicole Dubuc", "release_date": "2019-04-13"}, {"synopsis": "Shining Armor summons Twilight to Canterlot to settle their childhood \"Sibling Supreme\" competition once and for all. Having implemented a new set of security measures around Canterlot Castle, he challenges Twilight to breach them and steal a toy crown from the throne room. Twilight devises a plan with her friends, only for Shining Armor to boast by letter that he has already guessed it, prompting Rarity to suggest that each member of the group do the opposite of what he expects. After all their plans fail, Spike urges Twilight to go ahead with her original strategy. They successfully reach the throne room, only to be intercepted by Shining Armor, Princess Celestia, and Princess Luna. As Shining Armor gloats over his victory, Spike suddenly reveals that he has the crown, which was passed to him by Luna, who had secretly agreed to help him following a disagreement with Celestia about improving the castle's security. Twilight and Shining Armor award the crown to Spike and acknowledge him as their little brother.", "subseason_ep_number": "04", "absolute_ep_number": "200", "title": "Sparkle's Seven", "writer": "Nicole Dubuc & Josh Haber; story by Ashleigh Ball, Andrea Libman, Tabitha St. Germain, Tara Strong, & Cathy Weseluck", "release_date": "2019-04-20"}, {"synopsis": "While going through a box of her old things sent by Princess Celestia, Twilight finds a library book she borrowed years ago but never returned. Accompanied by Spike, she hurries to the Canterlot Library with the intent of returning it, but finds that the old librarian, Dusty Pages, no longer works there. Both Twilight and Dusty had perfect records in borrowing and maintaining books, respectively, and Twilight fears that the loss of this book cost Dusty her job. She and Spike track Dusty down to a retirement community and find her participating in several of its activities, but she firmly refuses to take the book or have anything to do with the library ever again. She explains that she was so worried about keeping her perfect record that she never had a chance to enjoy life. After the book went missing, she quit voluntarily and began to find happiness. Returning to Canterlot, Twilight pays the overdue fines and keeps the book as a reminder that there are more important things in life than trying to be perfect.", "subseason_ep_number": "05", "absolute_ep_number": "201", "title": "The Point of No Return", "writer": "Gillian M. Berrow", "release_date": "2019-04-27"}, {"synopsis": "While visiting Appleloosa to cheer on the Ponyville team in a buckball tournament, Rainbow Dash encounters Quibble Pants, who has started dating a unicorn mare named Clear Sky. Wind Sprint, her pegasus daughter by her late husband, enjoys the sport. Quibble knows nothing about it but buys her a buckball almanac and lets Rainbow Dash try to mold him into a sports enthusiast and athlete in an attempt to win her approval. Rainbow Dash's plan culminates in having Quibble, Wind and Snips play an exhibition game against Ponyville, but Quibble embarrasses himself badly with his ineptitude, prompting an exasperated Wind to storm off the field. He later apologizes to both Sky and Wind for trying too hard to impress them, and all three reconcile and settle down to enjoy the tournament with help from the almanac and Wind's knowledge of buckball.", "subseason_ep_number": "06", "absolute_ep_number": "202", "title": "Common Ground", "writer": "Josh Haber", "release_date": "2019-05-04"}, {"synopsis": "The School of Friendship is hosting a party called the Amity Ball and Sandbar asks Yona if she wants to be his \"Pony Pal\" to the dance, which she agrees but thinks that she needs to act more like a pony to impress him, prompting herself to seek Rarity's advice on how to behave like a pony. Through several tactics, ranging from Rarity making her a dress and teaching her how to speak properly, Fluttershy and Rainbow Dash teaching her how to dance and Applejack and Pinkie Pie making her a dish to bring to the dance, Yona becomes a well-sophisticated \"pony\". However, while attending the dance, Yona ends up embarrassing herself when her enhancements become their own obstacles and exits the dance ashamed. Sandbar catches up to her and says that he invited her to the dance because he likes her for the yak she is. Touched by his words, Yona and Sandbar arrive back to the dance, the ponies apologize for turning Yona into something she is not, and Twilight declares them as the winners of the Pony Pal Contest.", "subseason_ep_number": "07", "absolute_ep_number": "203", "title": "She's All Yak", "writer": "Brian Hohlfeld", "release_date": "2019-05-11"}, {"synopsis": "Grogar tasks Chrysalis, Tirek, and Cozy Glow with retrieving his Bewitching Bell, that was taken from him long ago and hidden at the top of Mt. Everhoof, but warns them that they must work together to accomplish it. Scoffing at Cozy's plan to team up, Chrysalis and Tirek move ahead separately. However, Cozy fails to talk her way past a guard in an avalanche zone while Chrysalis is unable to fly up the mountain due to the high winds. Tirek has already recognized the futility of climbing the mountain alone. That evening, they argue with each other, but begin to get along over their shared hatred for Twilight and her friends. They reach the peak by working together and Tirek temporarily borrows Chrysalis' magic to open a force field protecting the bell so that Cozy could get it out. Despite their success, they reject the possibility of becoming friends and decide to hide the bell from Grogar, intending to use it to betray him.", "subseason_ep_number": "08", "absolute_ep_number": "204", "title": "Frenemies", "writer": "Michael Vogel", "release_date": "2019-05-18"}, {"synopsis": "Accompanied by Fluttershy and Spike, Smolder takes a week off from class to visit and attempt to cheer up her brother in the Dragon Lands. To Spike and Fluttershy's dismay, however, her brother turns out to be Garble, who still delights in bullying Spike. Fluttershy and Smolder separately confront him and his friends over their behavior and Fluttershy later finds that Garble secretly enjoys writing beat poetry but is afraid to perform in public due to his fear of being ridiculed by his friends. Meanwhile, Ember is worried that a clutch of dragon eggs is taking far too long to hatch. Spike discovers that the ground is too cold to let the eggs develop and realizes that Garble's friends have been draining an underground lava reservoir so that they can surf and swim. Encouraged by Smolder, Garble performs his poetry for the other dragons, causing them to laugh so hard that they produce a fire hot enough to hatch the eggs. Ember proclaims that her subjects will start to celebrate their differences rather than make fun of them, and she and several other dragons ask Garble to teach them about writing poetry.", "subseason_ep_number": "09", "absolute_ep_number": "205", "title": "Sweet and Smoky", "writer": "Kim Beyer-Johnson", "release_date": "2019-05-25"}, {"synopsis": "The Apple family mobilize to bring in an enormous apple harvest, and Granny Smith calls in Goldie Delicious for additional help. Goldie tells Apple Bloom the story of the Great Seedling, a spirit that bestows bountiful crops on those who can catch it. Apple Bloom becomes determined to catch the Seedling to Applejack's dismay and annoyance. She had tried to catch it when she was young but got caught in one of her own traps and felt guilty for being unable to help with the harvest. Apple Bloom persuades Applejack to rekindle her old determination and help set up traps, leaving an extremely tired Big Mac to do more and more of the harvesting on his own. An apparition begins to chase the sisters through the orchards one night. It is revealed to be Big Mac, who has been harvesting in his sleep-in order to keep up with the workload. The harvest is finished ahead of schedule thanks to his night work, and Applejack comes to appreciate the importance of taking time off to have fun occasionally.", "subseason_ep_number": "10", "absolute_ep_number": "206", "title": "Going to Seed", "writer": "Dave Rapp", "release_date": "2019-06-01"}, {"synopsis": "Starlight tries to spend the day with Trixie but has to keep leaving in order to help the students at the School of Friendship. She finally tires of the workload, sends the students home for spring break, and closes the campus so she and Trixie can attend a party at Maud's cave. Suddenly, Silverstream's brother Terramar arrives saying that she never made it home to Mount Aris, and he and Starlight find notes indicating that she had been doing research on cockatrices. Terramar, Starlight, Trixie, Sunburst, Maud and Mudbriar enter the Everfree Forest to search for Silverstream, but a flock of cockatrices chase after them and petrifies Mudbriar. As the group take shelter at the Castle of the Two Sisters, Starlight realizes that Silverstream must be at the crystal treehouse on its grounds. The group finds her there, safe and working on her research with the help of a cockatrice she has tamed and named Edith. She apologizes for not informing anyone of her plans, Mudbriar recovers from his petrifaction, and Starlight resolves not to let her professional responsibilities take over her life.", "subseason_ep_number": "11", "absolute_ep_number": "207", "title": "Student Counsel", "writer": "Josh Haber", "release_date": "2019-06-08"}, {"synopsis": "While the Cutie Mark Crusaders are hanging out at Scootaloo's house, she gets a postcard saying that her parents, Snap Shutter and Mane Allgood, are coming home. They travel extensively to study exotic wildlife, leaving Scootaloo in the care of her aunts Holiday and Lofty, among others. Scootaloo is overjoyed to see them, but they shock her with their plans to take her with them as they move to Shire Lanka for a new job. The Crusaders devise several strategies to keep Scootaloo in Ponyville, but Snap and Mane push ahead with their plans and sell their house in preparation for the move. During a visit to Holiday and Lofty, the Crusaders find that they have inspired Lofty to break through her creative drought and give a Crusader theme to a quilt she has been making. They return to Ponyville and Scootaloo leads her parents to a town-wide celebration of the Crusaders' success. Snap and Mane let Scootaloo stay in Ponyville, realizing that the Crusaders' work is as important as their own, and Holiday and Lofty decide to move to town so they can look after her.", "subseason_ep_number": "12", "absolute_ep_number": "208", "title": "The Last Crusade", "writer": "Nicole Dubuc", "release_date": "2019-06-15"}, {"synopsis": "Invigorated by their fight against the Everfree Forest, Princess Celestia and Princess Luna start to take an active role in solving problems around Ponyville. They soon become a nuisance, so Twilight persuades them to take a vacation and leave her and her friends in charge of Equestria, the sun, and the moon for the duration. The group becomes overwhelmed with planning a royal ceremony until Twilight realizes the importance of delegating the work to experts so she and her friends can address more important issues. Meanwhile, tensions rise between Celestia and Luna over what sort of activities they should try, leading them to split up and take separate vacations. They eventually reconcile, admitting that they overreacted, and return to Canterlot to help Twilight move the sun and the moon properly.", "subseason_ep_number": "13", "absolute_ep_number": "209", "title": "Between Dark and Dawn", "writer": "Gail Simone", "release_date": "2019-06-22"}, {"synopsis": "After being invited to Cheese Sandwich's prank factory, Pinkie Pie takes the opportunity to discuss her purpose in life with him, dismayed that most of her friends are moving on. Upon her arrival, however, Cheese and his overly formal assistant, Sans Smirk, explain that Cheese has become unable to laugh ever since they started the factory to satisfy widespread demand for his novelties. Pinkie devises modifications to several of Cheese's pranks, but none of them make him laugh. She eventually realizes that he needs to see ponies laugh in person, and he regains his cheerful spirit after leading Sans and the employees in a factory-wide round of jokes. Cheese takes up his old role of a traveling party planner, leaving Sans in charge of the factory and promising to send back ideas for new products, and Pinkie returns to Ponyville with a new understanding of her purpose to make others happy.", "subseason_ep_number": "14", "absolute_ep_number": "210", "title": "The Last Laugh", "writer": "Michael P. Fox & Wil Fox", "release_date": "2019-08-03"}, {"synopsis": "After learning that Princess Celestia is starting an inter-scholastic buckball league, Twilight organizes a team at the School of Friendship. Rainbow Dash expects to coach it, but Twilight puts her in charge of the cheerleading squad instead, to her shock and dismay. Rainbow Dash does not care about cheerleading and initially leaves the squad, consisting of Ocellus, Smolder, Yona, and dancers Shimmy Shake and Lighthoof, to fend for themselves. She later gathers supplies for them from her friends, but still offers no help on effective cheering. The squad's first practice in front of the team is a disaster, and Smolder berates Rainbow Dash for not taking an interest even though the members and students do. Ashamed, Rainbow Dash rallies the squad and helps them coordinate their efforts to perform an energetic routine at the first game of the season.", "subseason_ep_number": "15", "absolute_ep_number": "211", "title": "2, 4, 6, Greaaat", "writer": "Kaita Mpambara", "release_date": "2019-08-10"}, {"synopsis": "Twilight is determined to become the first pony to win Trivia Trot, a Ponyville trivia contest, three times in a row. She is randomly paired up with Pinkie Pie, who has never played before, and the team soon falls behind due to Pinkie's stupidity. Worried that Pinkie is holding her back, Twilight begins to exploit the game's intricate rules in order to get the other teams penalized or disqualified, while distracting Pinkie so she can answer the questions herself. When Twilight tricks Pinkie into breaking the rules and getting herself disqualified, she pairs up with Sunburst, who takes over the game in order to keep up his own percentage of correct answers. They both realize that their drive to win has taken the fun out of the game, and Twilight apologizes to Pinkie and teams up with her again. Although they must give up their accumulated points and now have little chance of winning, they decide to have fun playing out the rest of the game.", "subseason_ep_number": "16", "absolute_ep_number": "212", "title": "A Trivial Pursuit", "writer": "Brittany Jo Flores", "release_date": "2019-08-17"}, {"synopsis": "Chrysalis, Tirek, and Cozy Glow take advantage of Grogar's absence to sneak into Canterlot and collect information on how to use the Bewitching Bell, while Twilight begins to plan the Summer Sun Celebration, intending to make it special for Princess Celestia and Princess Luna since it will be the last one before their retirement. She delegates tasks to Spike, Discord, and her friends, while the villains sabotage the preparations to distract everypony in order to buy time so they can break into the Canterlot Archives and steal a book on the bell. After Twilight's friends fail to solve the problems on their own and keep them a secret from her, she takes charge and coordinates their efforts to get back on schedule. The Celebration goes off without any trouble, and Twilight renames it \"The Festival of the Two Sisters\" in Celestia and Luna’s honor. Meanwhile, Chrysalis, Tirek, and Cozy return to Grogar's lair with the stolen book but realize that they have little time to master the bell for their own ends.", "subseason_ep_number": "17", "absolute_ep_number": "213", "title": "The Summer Sun Setback", "writer": "Michael Vogel", "release_date": "2019-08-24"}, {"synopsis": "As Fluttershy becomes increasingly busy at Sweet Feather Sanctuary, Angel becomes annoyed over her lack of time to spend with him and begins causing disturbances among the animals. While dropping off a smoke-belching gecko, which is really a fire lizard, for Fluttershy to examine, Zecora takes note of her strained relationship with Angel and suggests helping them understand each other's concerns better. When Fluttershy and Angel's feuding was getting worse, Zecora brews a potion that causes them to switch bodies. Angel, in Fluttershy's body, does a half-hearted job of looking after the animals, while Fluttershy, in Angel's body, is unable to tell anypony what has happened. Angel's lack of attention to the chores leads to chaos at the sanctuary, and Fluttershy exhausts herself seeking help. In order to revive her, Angel organizes the animals to retrieve a set of keys inhaled by a baby elephant who has in turn been swallowed whole by a python. Once Fluttershy regains consciousness, she and Angel reconcile, and the potion wears off. Angel offers to assist her at the sanctuary, and she promises to make time for him.", "subseason_ep_number": "18", "absolute_ep_number": "214", "title": "She Talks to Angel", "writer": "Nick Confalone", "release_date": "2019-08-31"}, {"synopsis": "When Spike decides to spend time apart from Rarity, she begins to worry that she has done something to offend him. However, she soon learns that he has been visiting Gabby, now that they have become pen pals, and she frequently delivers mail to Ponyville. Unable to get Spike's level of assistance and attention from her other friends, Rarity schemes to take up as much of Spike's time as she can with activities he enjoys. Gabby is heartbroken over his sudden abandonment of her, and Rarity sees the problem her own actions are causing. She apologizes to both of them, and all three acknowledge that the beginning of a new friendship does not mean the end of an existing one.", "subseason_ep_number": "19", "absolute_ep_number": "215", "title": "Dragon Dropped", "writer": "Josh Haber", "release_date": "2019-09-07"}, {"synopsis": "With her coronation approaching, Twilight decides to appoint Starlight as the new headmare for the School of Friendship. When Trixie comments that Twilight ran the school with her friends, Starlight decides to appoint a vice-headmare. Octavia Melody, Dr. Hooves, Big Mac, Spoiled Rich, and Trixie all apply for the position. As the interviews progress, Starlight realizes that Trixie is hopelessly unsuited for the job but does not reject her out of respect for their friendship. When Trixie endangers the students during an in-class field trip, Starlight angrily berates her for her carelessness. After Twilight reminds her that not everypony is right for a given job, Starlight apologizes to Trixie and acts on her suggestion to hire Sunburst as vice-headstallion after the remaining candidates withdraw their applications. Seeing that Trixie would make a good student counselor, Starlight appoints her to the position.", "subseason_ep_number": "20", "absolute_ep_number": "216", "title": "A Horse Shoe-In", "writer": "Ariel Shepherd-Oppenheim", "release_date": "2019-09-14"}, {"synopsis": "Surprised to learn from Fluttershy that a new Daring Do book has been published that presents an unflattering view of the explorer, Rainbow Dash and Fluttershy confront the author, who is actually Dr. Caballeron in disguise and who claims that the museum he runs has gone broke due to Daring Do’s long-running thefts of artifacts from ancient sites. Fluttershy decides to join his team on their latest journey in order to decide for herself on who is telling the truth. During the entire trip, Caballeron begins to learn the importance of kindness from her. Rainbow Dash and Derring Do catch up to the team as Fluttershy recovers a talisman that forces its holder/wearer to tell the truth, but Ahuizotl suddenly traps all of them in an underground chamber. Upon escaping and finding Ahuizotl, the group learn that, under the talisman's influence, Ahuizotl's villainy was actually his job to guard the artifacts in the area from being stolen, to which Daring Do and Caballeron apologize to him and promise not to loot any more ruins. After Ahuizotl sets the group free, Daring Do and Caballeron put their differences aside and collaborate on a new book about their adventures, only for it to sell poorly due to Ahuizotl also having written one of his own.", "subseason_ep_number": "21", "absolute_ep_number": "217", "title": "Daring Doubt", "writer": "Nicole Dubuc", "release_date": "2019-09-21"}, {"synopsis": "The Cutie Mark Crusaders want to go to a county fair in Appleloosa, but have not coordinated finding a chaperone, and Twilight and her friends are all too busy to accompany them and warn them against trying to make the trip on their own. When they voice their wish to become adults, a magical flower that Twilight and Fluttershy are studying grants it. They promptly board a train to Appleloosa, believing they now know everything they need, but mistakenly get off at the wrong station and soon become lost in the nearby swamps. There, they meet two foals, Biscuit and Spur, who are arguing over whether to take their pet Whirling Mungtooth, Bloofy, to the fair. The Crusaders follow them to the fair and suggest that they share the job of looking after Bloofy, but leave to enjoy themselves. Bloofy becomes overly agitated by the noise and crowds and grows into a dangerous whirlwind, leaving Biscuit, Spur, and the Crusaders at a loss for what to do. Twilight and Fluttershy track them down, and Spur successfully calms Bloofy down with Fluttershy's help. The Crusaders make another wish on the flower to return to their normal ages, apologize to Biscuit and Spur for their deception and offer to come visit them again, as long as a real adult accompanies them.", "subseason_ep_number": "22", "absolute_ep_number": "218", "title": "Growing Up is Hard to Do", "writer": "Ed Valentine", "release_date": "2019-09-28"}, {"synopsis": "Without telling each other, Big Mac and Sugar Belle have devised unorthodox methods to propose marriage, both of which involved a clue-note scavenger hunt: Big Mac prepares a load of apples with clues to lead Sugar Belle to Sweet Apple Acres, while Sugar Belle writes notes for Mrs. Cake to insert into a batch of desserts she is making for Big Mac. Mrs. Cake's baking-under-pressure with the Cutie Mark Crusaders spoils the recipes, and both plans go awry after Spike and Discord get involved, with Discord mutating the apples horrendously so Sugar Belle will notice them, resulting in a giant monster that bellows Big Mac's proposal when Discord attempts to mend this, and Spike accidentally burning the already-spoiled desserts to a crisp. After both sides discover that they have been working at cross purposes, Big Mac and Sugar Belle propose to one another in private and happily accept, taking inspiration from the love that Big Mac's parents had for each other. Their wedding is held in the orchards, with Spike, Discord, Mrs. Cake and the Crusaders reflecting on how their mistakes combined to give such a happy outcome, though Discord gets the last laugh when he has the mutated apples sing at the wedding.", "subseason_ep_number": "23", "absolute_ep_number": "219", "title": "The Big Mac Question", "writer": "Josh Haber & Michael Vogel", "release_date": "2019-10-05"}, {"synopsis": "On the day of Twilight’s coronation, Chrysalis, Tirek and Cozy Glow successfully unlock the power of the Bewitching Bell, allowing them to use it to make themselves all-powerful. They betray Grogar and drain him of his magic, revealing him to be Discord in disguise. Discord travels to Canterlot and reveals this to Twilight and her friends while explaining that his actions as Grogar were intended to prepare Twilight for her new role. While everypony are horrified and furious at Discord for what he has done, Twilight rallies her friends and allies to prepare for the attack. The villains soon attack Equestria, with Cozy Glow invading Canterlot Castle and draining Princess Celestia and Princess Luna of their magic, Tirek defeating the Pillars, and Chrysalis ravaging the School of Friendship and capturing Starlight. They regroup at the castle, where they overpower Twilight and her friends and reveal that they have managed to turn the pony races against each other. After her friends insist that she retreat, Twilight teleports away while the others are overwhelmed by the villains.", "subseason_ep_number": "24", "absolute_ep_number": "220", "title": "The Ending of the End - Part 1", "writer": "Nicole Dubuc", "release_date": "2019-10-12"}, {"synopsis": "Chrysalis, Tirek and Cozy Glow imprison the ponies and celebrate their victory but argue over what to do with the magic they have stolen. Discord enacts a plan to free Starlight so she can release the others, and they fend off the villains while Twilight's friends escape. As they search for Twilight, they find her taking refuge in the Crystal Empire and lost hope. Suddenly, the Windigos return as a result of the hostility between the pony races and brings forth freezing weather. Encouraged by her friends, Twilight regains her confidence, and they return to Canterlot to confront the villains. The villains gain the upper hand until a giant army consisting of all of Equestria and the other kingdoms, united by Twilight's students, appears to assist in the battle. Twilight unites the magic of friendship within her friends, the Young Six and the Pillars to evaporate the Windigos and strip the villains of their power, after which Celestia, Luna and Discord turn them into stone as punishment for their crimes. Celestia expresses that she is proud of Twilight and that she is officially ready to rule Equestria. Twilight postpones her coronation so she and her friends can spend some quiet time after the battle.", "subseason_ep_number": "25", "absolute_ep_number": "221", "title": "The Ending of the End - Part 2", "writer": "Michael Vogel", "release_date": "2019-10-12"}, {"synopsis": "In a distant future, Twilight is visited by her top student, Luster Dawn, who does not understand the importance of friendship, so Twilight tells her a story of how she was once worried about losing her friendships. Flashing back to her coronation day, Twilight prepares to move back to Canterlot with Spike, but worries about drifting apart from her friends. However, her friends seem welcoming of this change and focus more on the final preparations for the ceremony. Twilight expresses her frustration about her friends' contentedness to her moving away, but they reveal that they do share her concerns and have been keeping themselves busy so they would not be sad about it either. They let out their feelings and cry together, which makes Twilight feel better, knowing that her friends feel the same way, but this causes them to fall behind on their preparations and almost missing the train to Canterlot. Twilight makes it just in time for her coronation, but the ceremony encounters many problems. After the group share a laugh about the disastrous ceremony, Twilight decides to establish a Council of Friendship so she can maintain her relationships with her friends by convening once every moon, while Celestia and Luna retire to Silver Shoals. Back in the future, Twilight finishes her story, and her friends arrive, revealing they have remained friends and are ruling Equestria together as the Council. Twilight explains to Luster that friendships can be hard to maintain, but life is even harder without them. Luster takes the lesson to heart and Twilight sends her to Ponyville, where she begins to make friends and have adventures of her own.", "subseason_ep_number": "26", "absolute_ep_number": "222", "title": "The Last Problem", "writer": "Josh Haber", "release_date": "2019-10-12"}]]